[
    {
        "title": "Front Desk / Office Assistant",
        "Company_name": "James Fowler Physical Therapy",
        "location": "New York, NY",
        "salaryEst": "$20.00 – $24.00/hr (Employer est.)",
        "description": "Front Desk / Office Assistant\n\nJob description\n\nCome join a thriving physical therapy practice in Union Square, Manhattan! If you're a friendly, people loving, well-organized team player with office management experience - we'd love to talk about adding you to the JFPT Team.\n\nWe invite all applicants to visit jamesfowlerpt.com to learn more about our services and specialized programs. Gaining an understanding of our approach will allow you to craft a more personalized and thoughtful cover letter, showcasing how your skills and values align with our mission. We truly value cover letters that reflect a genuine interest in the work we do and the difference we make in our community.\n\nOffice Admin is responsible for smooth running of the day-day office including but not limited to the following tasks:\n\n● Oversee the customer/patient experience (greeting upon entry and exit, and handle all scheduling needs)\n\n● Oversee administrative functions (supplies, filing, managing insurance verification, client communication).\n\n● Assisting Billing Department with insurance calls, appeals, and patient communication, as needed.\n\n● Clear communication amongst office and patients.\n\nMarketing Assistance: a dynamic marketing assistant, who can help grow the practice and help our marketing team implement a strong marketing strategy\n\n● Assist marketing team in realizing social media presence and goals\n\n● Assist with monthly sales initiatives\n\n● Assist our Physician Referral Program (Relationships between our practice and our referral base. This includes communicating with front desk staff, office managers, and doctors throughout Manhattan)\n\nSkills necessary include:\n\n● Ability to work in fast-paced environment and multi-task\n\n● Articulate and professional – must have excellent people skills on the phone and in-person\n\n● Excellent organization skills\n\n● Excellent communication skills\n\n● Self-motivated with the ability to work independently and as part of a team\n\n● Detail-Oriented (required)\n\nQualifications:\n\n● Experience in office management and/or customer service\n\n● Experience working with insurance – (preferred)\n\n● Must enjoy working in a team environment\n\n● Bachelor’s or Associate's degree (preferred)\n\n● Two references that can attest to work ethic and/or customer service skills\n\nJob Type: Part-time with opportunity of Full-time\n\nPay: $16.00 - $20.00 per hour\n\nSchedule:\n\n● 4-5 shifts, 6-8 hours/day\n\nExperience:\n\n● Office Admin/Assistance: 2 years (Required)\n\n● Customer service: 2 years (Required)\n\nWork Location: In person\n\nCONTACT PERSON:\n\nIdelsi Olivero (Practice Manager)\n\nJob Types: Full-time, Part-time\n\nPay: $20.00 - $24.00 per hour\n\nExpected hours: 30 – 40 per week\n\nSchedule:\n\n8 hour shift\n\nWork Location: In person\n\nShow less"
    },
    {
        "title": "Data Entry Clerk",
        "Company_name": "JONATHAN Y DESIGNS",
        "location": "New York, NY",
        "salaryEst": "$45K – $50K/yr (Employer est.)",
        "description": "We are looking for a Data Entry Clerk to join our Imports team at JONATHAN Y DESIGNS. This is a hands-on role requiring attention to detail, excellent communication and organizational skills and the ability to efficiently collaborate with different team member to ensure all inbound shipments are successfully entered in our system.\n\nRESPONSIBILITIES:\n\n· Assist the Import team to process ocean shipping documents\n\n· Sort all documents for data entry\n\n· Accurately enter packing list, country of origin, commercial invoice and any other commercial documents or reports related to the shipment\n\n· Ensure the correct duty rate is paid for all import entries\n\n· Confirm documentation is accurately processed and released to carrier, forwarders and agents in a timely manner\n\n· Review discrepancies in data received\n\n· Update shipping confirmations and other shipping information in the system\n\n· Monitor all shipments in transit and update arrival dates in the system\n\n· Process claims and credit for delayed shipments, ensuring carrier accountability\n\nQualifications\n\n· Strong proficiency in Microsoft Excel (V-lookup, pivot tables, data entry)\n\n· Excellent time management and multitasking skills\n\n· Detail oriented with excellent organizational and multitasking skills\n\n· Strong written and verbal communication skills\n\n· Prior experience in logistic or data entry is a plus.\n\nJob Type: Full-time\n\nPay: $45,000.00 - $50,000.00 per year\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\nMonday to Friday\n\nExperience:\n\nData entry: 1 year (Preferred)\nMicrosoft Excel: 1 year (Preferred)\nLogistics: 1 year (Preferred)\n\nAbility to Commute:\n\nNew York, NY 10016 (Required)\n\nWork Location: In person\n\nShow less\nSee company reviews"
    },
    {
        "title": "Packer",
        "Company_name": "Rosemary Kosher Supermarket",
        "location": "Brooklyn, NY",
        "salaryEst": "$16.50/hr (Employer est.)",
        "description": "Overview\nWe are seeking dedicated and detail-oriented Packers to join our team. In this role, you will be responsible for preparing and packaging products for shipment, ensuring that all items meet quality standards. As a Packer, you will play a crucial role in our production process, contributing to the overall efficiency and success of our operations.\n\nResponsibilities\n\nExpertly bagging groceries: Carefully and efficiently packing items into bags, ensuring proper weight distribution and preventing damage.\nAssisting cashiers: Working closely with cashiers to maintain a smooth flow at the checkout.\nProviding friendly customer service: Interacting with customers in a courteous and helpful manner.\nMaintaining a clean and organized bagging area: Ensuring the checkout area is tidy and well-stocked.\nAssisting with carry-out service: Helping customers transport their groceries to their vehicles when needed.\n\nSkills\n\nStrong attention to detail and accuracy in bagging.\nAbility to work quickly and efficiently in a fast-paced environment.\nAbility to lift and carry grocery items of varying weights.\nExcellent teamwork and communication skills.\nFriendly and customer-focused attitude.\nProficiency in spoken English.\nPrevious experience in a grocery or retail setting is a plus.\n\nJoin our team as a Packer and contribute to delivering high-quality products while working in a supportive and dynamic environment!\n\nJob Type: Full-time\n\nPay: $16.50 per hour\n\nExpected hours: 45 – 55 per week\n\nSchedule:\n\nMonday to Friday\nWeekends as needed\n\nWork Location: In person\n\nShow less"
    },
    {
        "title": "Regal Cast Member $16.50/Hour",
        "Company_name": "Regal Cinemas, Inc",
        "location": "New York, NY",
        "salaryEst": "$34K – $44K/yr (Glassdoor est.)",
        "description": "Team members are classified based on individual theatre needs, and/or employee availability, as either variable hour, part-time fixed, part-time regular or full-time hourly employees whose primary responsibility is ensuring our guests receive exceptional service. Team members may be scheduled to work in the Box Office, Concession Stand, or as an Usher. Team members employees must act as a representative of Regal in a way that is consistent with our mission statement and policies; including\n\nRegular and consistent attendance\nHandling of emergency situations when called upon to do so\nGeneral cleaning duties; and\nCompliance with our company dress code.\n\nEssential Duties and Responsibilities for each position include, but are not limited to, the following:\n\nBox Office\n\nOperating POS system, including the proper handling of and responsibility for accuracy of cash drawer, credit cards, travelers’ checks, gift cards and redeemed discount tickets, passes and coupons\nUp selling/suggestive selling of Premium Viewing Experience (3D, RPX, IMAX).\nPromoting the Regal Crown Club program\nEnsuring tickets are sold in accordance with the MPAA rating system and company policy\nResponding to phone calls and questions from guests in a manner that is consistent with our guest service philosophy\n\nConcession\n\nOperating POS system, including the proper handling of and responsibility for accuracy of cash drawer, credit cards, travelers’ checks, gift cards and redeemed coupons as well as concession stock inventory.\nPromoting the Regal Crown Club program\nOperating, preparing and cleaning of all concession related equipment\nUp selling/Suggestive selling\nComplying with all local, state and federal food safety laws.\nAbide by all federal and state laws with regards to breaks and/or meal periods.\nEnsure required alcohol certification and training are current where applicable.\nIf the theatre sells alcohol and your assigned duties will include the selling/serving of alcohol, you must be of legal age to sell or serve alcohol according to state or local laws.\nRequired to read and understand training materials that will cover subjects such as sexual harassment and discrimination.\n\nUsher\n\nTearing tickets, collecting and depositing appropriate stub, and directing patrons to their auditoriums.\nInspecting backpacks and packages when applicable.\nManaging crowd control and assisting guests in finding seats in auditoriums when necessary\nEnforcement of MPAA rating system\nConducting in theatre inspections to monitor picture and sound quality, watch for film and content theft, and help maintain a safe quality environment within the auditoriums\nReporting to the management any problems, discrepancies or unusual situations that arise at the theatre.\nPerform in-auditorium concession auxiliary sales as directed by management\nCleaning auditoriums at the end of scheduled shows and maintaining clean restrooms, lobby area, hallways and other areas outside of the auditorium\nMonitoring the cleanliness and operation of theatre vending equipment\nAssisting with all opening and closing duties as assigned by management\n\nPay Scale Information: $12.75 per hour\n\nBenefits: Our team receives the perk of enjoying free movie passes and discounted concessions at any Regal location. Additionally, all team members are eligible to participate in our 401(k) retirement plan, with a company match, once they reach the age of 21 and have completed six months of service.\n\nQualifications:\n\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nEducation/Experience:\n\nCompletion of cast certification program as a cast member and as box office cashier or progress towards completion required.\n\nIf the theatre sells alcohol and your assigned duties will include the selling/serving of alcohol, it is your responsibility to complete any legally required state or local training and obtain the required certificate. In addition, you must complete the Regal Responsible Beverage Server training on Regal Academy.\n\nLanguage Ability:\n\nPossess good public speaking, listen effectively and respond clearly and directly.\n\nMath Ability:\n\nPerform calculations with speed and accuracy and identify and correct errors.\n\nReasoning Ability:\n\nIdentify problems, gather relevant data and note possible causes of problems. Evaluate relevant information, recognize alternatives and reach conclusions based on evidence. Take action beyond what is necessarily called for. Perform under pressure and/or opposition.\n\nPersonal Skills:\n\nPossess excellent communication skills with customers, co-workers and management. Establish goals, budget time, and set priorities to achieve desired objectives.\n\nPhysical Demands:\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nWhile performing the duties of this job the employee is frequently required to stand; walk; sit; use hands to finger, handle, or feel; reach with hands and arms and talk or hear. The employee is occasionally required to climb or balance and stoop, kneel, crouch, or crawl. The employee may occasionally be required to lift up to 60 pounds. The vision requirements include: close vision, distance vision, peripheral vision, depth perception and ability to adjust focus.\n\nShow less\nSee company reviews"
    },
    {
        "title": "Handler Warehouse - Part Time (Warehouse like)",
        "Company_name": "Fedex",
        "location": "New York, NY",
        "salaryEst": "$19.80/hr (Employer est.)",
        "description": "Job Duties\n\nProvides movement of packages, documents, dangerous goods and/or supply support in a timely, safe and efficient manner through effective scan/load methods. This is a non-driving position (public roadways). Performs other duties as assigned.\n\n\nMinimum Education\n\nNone\n\n\nMinimum Experience\n\nNone\n\n\nKnowledge, Skills and Abilities\n\nAble to lift 50 lbs. without assistance from the ground to chest level and ability to maneuver packages of any weight above 50 lbs. using appropriate equipment and/or assistance from another person. Able to walk and stand for designated work hours. Able to bend and squat for designated work hours. Able to maneuver packages above shoulder level. Ability to maneuver packages in enclosed spaces and stack packages above one’s head if required at location. Able to work in all weather conditions if required at work location. Able to climb stairs and ladders if required at work location. Able to successfully complete all basic and re-currency training. The ability to communicate both timely and effectively, in a noisy operations environment, is required.\n\n\nJob Conditions\n\nNon-covered safety sensitive position. Ability to work in a constant state of alertness and in a safe manner.\n\n\nPay Transparency\n\nThis compensation range is provided as a reasonable estimate of the current starting salary range for this role across all potential locations. If this opportunity includes multiple job levels, the salary information represents the job level minimum and the job level maximum. Actual starting pay would be determined by experience relative to the job, market level, pay at the location for this job and other job-related factors permitted by law. An employee may be eligible for additional pay, premiums, or bonus potential. The Company offers eligible employees health, vision and dental insurance, retirement, and tuition reimbursement.\n\n\nPay Range: ﻿$19.80 / hour - $19.80 / hour﻿\n\n\nAdditional Posting Information: ﻿Seeking 2 positions.﻿\n\n\n\n\n\nEEO Statement\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. Reasonable accommodations are available for qualified individuals with disabilities throughout the application process. Applicants who require reasonable accommodations in the application or hiring process should contact recruitmentsupport@fedex.com.\n\nApplicants have rights under Federal Employment Laws:\n\nEqual Employment Opportunity is the Law\nEEO is the Law Supplement\nPay Transparency Policy\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act\n\n\nE-Verify Program Participant: Federal Express Corporation participates in the Department of Homeland Security U.S. Citizenship and Immigration Services' E-Verify program (For U.S. applicants and employees only). Please click below to learn more about the E-Verify program:\n\nE-Verify Notice (bilingual)\nRight to Work Notice (English) / (Spanish)\nShow more\nSee company reviews"
    },
    {
        "title": "Front Desk Receptionist/Office Assistant",
        "Company_name": "2 Wise Women",
        "location": "New York, NY",
        "salaryEst": "None",
        "description": "About us\n\n2 Wise Women is a small business in New York, NY 10001. We are autonomous, fun, professional and our goal is to have a great team in a medical setting..\n\nOur work environment includes:\n\nWellness programs\nCasual work attire\nFlexible working hours\nOn-the-job training\n\nWe are looking to add to our team at the front desk. We need someone who loves people and doesn’t mind being the first person our patients see. They must be able to handle multiple tasks at any given time when we are busy and to keep busy when we are not. This position is perfect for someone with experience working in an office and is looking for a long term job that will grow as our office grows.\n\nWork Remotely\n\nNo\n\nJob Type: Part-time\n\nPay: $15.00 - $18.00 per week\n\nBenefits:\n\nEmployee discount\nFlexible schedule\n\nSchedule:\n\n4 hour shift\n\nWork Location: In person"
    },
    {
        "title": "Co-op, In-Flight Services (IFS - NYC) - Integration Project Coordinator (Summer 2025)",
        "Company_name": "Delta Airlines",
        "location": "New York, NY",
        "salaryEst": "$19.02 – $23.47/hr (Employer est.)",
        "description": "UNITED STATES, NEW YORK, NEW YORK\n\n\nINFLIGHT SERVICES\n\n\n18-FEB-2025\n\n\nREF #: 27634\n\n\nPAY RANGE: $19.02 - $23.47 PER HOUR\nHOW YOU'LL HELP US KEEP CLIMBING (OVERVIEW & KEY RESPONSIBILITIES)\nThe IFS Base Operations team is seeking a highly motivated and data-driven individual eager to apply their project management and analytical skills in support of impactful business projects and initiatives. This team plays a key role in driving Delta’s IFS base operations, contributing to both system-wide and company-wide strategic goals, as well as engagement opportunities across the organization. As a co-op with the IFS Base Ops team, you will work with our NYC (LGA/JFK) team to gain hands-on experience in data analysis, generating insights, and contributing to real-world projects related to on-time departures, leader recognition, flight attendant and leader engagement, and DE&I. This position provides an excellent opportunity to further develop project management skills while working with cross-functional teams in a dynamic environment.\n\nResponsibilities will include:\nIdentify trends within reliability metrics\nCreate and streamline the collection process for leader recognitions\n• Leverage and query data sources to answer business questions • Develop effective presentations to share findings and recommendations to leaders\nAssist in organizing and facilitating meetings to communicate project plans, goals, and progress\nContribute to regular status reports and updates for stakeholders and sponsors.\n\nThe selected candidate will fulfill the following Co-op rotation(s) based in New York City (LGA and/or JFK) while maintaining enrollment at your university:\n1st Rotation: Summer 2025\n2nd Rotation: Spring 2026\n3rd Rotation: Fall 2026\n\nPay Range: $22.56 - $23.47 per hour\nBENEFITS AND PERKS TO HELP YOU KEEP CLIMBING\n\nOur culture is rooted in a shared dedication to living our values – Care, Integrity, Resilience and Servant Leadership – every day, in everything we do. At Delta, our people are our success. At the heart of what we offer is our focus on Sharing Success with Delta employees. Exploring a career at Delta gives you a chance to see the world while earning great compensation and perks to help you keep climbing along the way:\n\nDomestic and International space-available flight privileges for employees and eligible family members.\nCareer development programs to achieve your long-term career goals.\nWorld-wide partnerships to engage in community service and innovative goals created to focus on sustainability and reducing our carbon footprint.\nBusiness Resource Groups created to connect employees with common interests to promote inclusion, provide perspective and help implement strategies.\nRecognition rewards and awards through the platform Unstoppable Together.\nAccess to over 500 discounts, specialty savings and voluntary benefits through Deltaperks such as car and hotel rentals and auto, home, and pet insurance, legal services, and childcare.\nWHAT YOU NEED TO SUCCEED (MINIMUM QUALIFICATIONS)\nCurrently pursuing a bachelor’s degree in business that has the flexibility to support a co-op role\nPossesses excellent problem-solving skills, able to collaborate effectively with Base Operations team members\nProficient in Microsoft Office Suite and experience with SharePoint preferred but not required. Smartsheet and Power BI experience a plus\nExperience or a demonstrated interest in data analysis\nExhibits a drive for results and takes ownership of assigned task and responsibilities\nDetailed-oriented, with the ability to meet deadlines and effectively manage time\nHighly preferred: curiosity, sense of humor, willingness to try new ideas, and flexibility\nConsistently prioritizes safety and security of self, others, and personal data.\nEmbraces diverse people, thinking, and styles.\nIs at least 18 years of age and has authorization to work in the United States.\nWHAT WILL GIVE YOU A COMPETITIVE EDGE (PREFERRED QUALIFICATIONS)\nAbility to tackle multiple projects at once, adhering to different timelines and working with many cross-functional partners to ensure alignment and consistency within each project\nAbility to develop effective presentations that help tell a story and present an idea/recommendation to leaders in an efficient and effective manner\nExperience performing statistical analysis and modeling (i.e., linear regression, segmentation, non-linear predictive regression, operations research, and/or machine learning) If you are passionate about data-driven decision-making, innovating, and eager to make a meaningful impact, this role is the ideal opportunity for you!\n\nShow less\nSee company reviews"
    },
    {
        "title": "Summer 2025 Associate, Hospitality",
        "Company_name": "Excel Sports Management",
        "location": "New York, NY",
        "salaryEst": "$16.50/hr (Employer est.)",
        "description": "Excel Sports Management is an industry-leading sports agency representing top-tier talent, blue-chip brands and marquee properties. Our success is rooted in our people, our high character reputation and our commitment to creating a diverse and welcoming workplace. We focus on team chemistry, collaboration, strong relationships, valuable networks, and ambitious ideas to deliver innovative solutions that keep our clients and agency ahead of the curve.\n\n\n\n\nExcel Sports Management is an Equal Opportunity Employer (EOE).\n\nOur Associate program is a paid opportunity that allows participants to contribute to the organization's success while at the same time applying learnings from the classroom. This semester we will continue with a hybrid program and will offer each participant the opportunity to gain in-office experience for approximately 3-days a week. Associates are responsible for their individual transportation and housing needs.\n\n\n\n\nAssociate Expectations:\n\nAll Associates are expected to work 24-29.9 hours a week during the session. While each Associate will be working with a specific division, they will have the opportunity to learn about other areas within Excel, through lunch and learns held throughout the semester.\n\n\n\n\nImportant Dates:\n\nOur Summer Program runs from Monday, June 2nd, 2025 through Friday, August 22nd, 2025\n\n\n\n\nOffice Hours:\n\n9:00 am‐6:00 PM ET, Monday-Friday OR as agreed upon with advisor. Days in office must be coordinated with Advisor's schedules.\n\n\n\nOur Associates must:\n\nBe available to work under 30 hours per week.\nBe available to report to the New York office approximately 3-days a week.\nHave a senior standing in college (must have completed your junior year of undergrad)\n\nOR\n\nBe enrolled in a graduate school\n\nOR\n\nHave a bachelor's or postgraduate degree.\n\n\n\nInterview Process:\n\nApplications will close on April 4th, 2025\nIf selected, the expectation is that offers will be extended mid-end of April.\nThe program will begin on June 2, 2025.\n\n\n\nHospitality Associate Expectations:\n\nAssists Hospitality team with end-to-end client hospitality initiatives, from asset management to full client deliverables;\nWill learn how to build and maintain positive client relationships that result in increased reliance upon Excel;\nWill learn how to develop ideas for engaging event branding, collateral, and on-site materials;\nWill learn how to create planning tracking tools and on-site materials: rooming lists, confirmation documents, food and beverage schedule, transportation manifest, etc.\nAssists in the management and data upload/tracking of client deliverables;\nAssists the Hospitality team with confidential client projects;\nWill gain a thorough understanding of the coordination and planning process of hospitality events and/or appearances for clients;\nWill learn the process of negotiation and execution of contracts;\nWill gain cross-functional exposure in the collaboration of client presentations and/or pitches;\nWill have access to the Excel team for industry advice and learnings;\nMay occasionally be assigned projects outside the Brand Marketing group to gain exposure to other divisions within Excel;\nMay be asked to travel for event work and provide on-site support for events outside of normal business hours\n\n\n\nThe pay for this position is: $16.50 per hour. Please note that the foregoing compensation information is a good-faith assessment associated with this position only and is provided pursuant to the California and New York City Salary Transparency Law.\n\nThis position is not eligible for sponsorship.\n\n\n\n\nExcel Sports Management provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, leaves of absence, compensation and training.\n\nShow less\nSee company reviews"
    },
    {
        "title": "Caretaker",
        "Company_name": "NYC HOUSING AUTHORITY",
        "location": "New York, NY",
        "salaryEst": "$36K – $51K/yr (Employer est.)",
        "description": "NYC HOUSING AUTHORITY\nPosted On: 03/06/2025\nFull-Time\nLocation\nNYC-ALL BOROS\nNo Exam Required\nDepartment\nTechnical Resources\n\nSalary Range:\n$36,006.00 – $50,569.00\nJob Description\n\n1. Sweep and mop public building spaces, basement areas and stair halls.\n2. Remove snow and encumbrances; spread sand and salt over icy pavements; wash windows and walls of public spaces.\n3. Clean ramps, drains, roofs and canopies; polish and wax as required; change light bulbs including those in lampposts; move, lift and carry heavy objects and materials.\n4. Clean work areas and offices as required.\n\nPlease read this posting carefully to make certain you meet the qualification requirements before applying to this position.\n\nAdditional Information:\n1. NYCHA employees applying for transfer, promotional, title or level change opportunities must have served a period of one year at current location and in current title and level (if applicable).\n2. NYCHA residents are encouraged to apply.\n\nCARETAKER (HA) - 90645\n\n\nMinimum Qualifications\n\n\nQualification Requirements\nThere are no formal education or experience requirements for this position.\n\n\nPublic Service Loan Forgiveness\n\n\nAs a prospective employee of the City of New York, you may be eligible for federal loan forgiveness programs and state repayment assistance programs. For more information, please visit the U.S. Department of Education’s website at https://studentaid.gov/pslf/.\n\n\nResidency Requirement\n\n\nNYCHA has no residency requirements.\n\n\nAdditional Information\n\n\nThe City of New York is an inclusive equal opportunity employer committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, veteran status, gender identity, or pregnancy.\n\nShortlist\n\nJob ID\n692117\nTitle code\n90645\nCivil service title\nCARETAKER (HA)\nTitle classification\nLabor-3\nBusiness title\nCaretaker\nPosted until\n03/25/2025\nExperience Level:\nEntry-Level\nJob level\n00\nNumber of positions\n1\nWork location\nCentral Shops\nCategory:\nBuilding Operations & Maintenance\n\nCaretaker\n\nShow less\nSee company reviews"
    },
    {
        "title": "Matterport Scanner / Uploader",
        "Company_name": "Energy Control Service",
        "location": "New York, NY",
        "salaryEst": "$22.00 – $30.00/hr (Employer est.)",
        "description": "Scanning Commercial Office Real estate spaces and uploading images to Matterport.\n\nJob Type: Part-time\n\nPay: $22.00 - $30.00 per hour\n\nExpected hours: 20 – 25 per week\n\nSchedule:\n\nDay shift\n\nAbility to Relocate:\n\nNew York, NY: Relocate before starting work (Required)\n\nWork Location: On the road\n\nShow less"
    },
    {
        "title": "Desktop Support",
        "Company_name": "Cantor Fitzgerald",
        "location": "New York, NY",
        "salaryEst": "$24.00 – $30.00/hr (Employer est.)",
        "description": "Desktop Support Role\n\nRole Summary:\n\nDesktop support will be responsible for providing assistance to all front and back-office staff. This individual will be responsible for supporting the various different business lines throughout the Cantor umbrella. This is a hands-on role and this individual is expected to provide technical expertise in order to resolve issues for the general population.\n\nKey Accountabilities:\n\nProvide IT support to all users in the Americas\n\nProvide support through phone/email/service tickets to front and back-office users on desktop issues\n\nInstall, upgrade, support and troubleshoot Windows operating systems, computer hardware (and any other authorised peripheral equipment) and across a range of authorised software applications\n\nPerform general preventative maintenance\n\nAssist facility matters when needed including moves, adds, and changes\n\nRaise, update and close all support tickets regularly and promptly.\n\nParticipate and implement in global projects\n\nProvide on-site and remote support\n\nCommunicate with team members regarding issues, procedures, and documentation\n\nKnowledge:\n\nIn depth knowledge of Windows desktop technologies.\n\nIn depth knowledge of Desktop and laptop hardware.\n\nIntermediate knowledge of TCP/IP, DNS and Internetworking Technology\n\nIntermediate knowledge of Microsoft Office (Word, Excel, PowerPoint, Outlook)\n\nKnowledge of Server, Voice & Communications Infrastructure.\n\nKnowledge of various Operating systems (e.g. Windows, Linux, Apple)\n\nKnowledge of Audio and Video Conferencing technologies.\n\nKnowledge of common Market Data applications and services.\n\nRelevant industry certifications may include Microsoft MCP, MCSA or individual Microsoft specialist training such as Excel, Word, PowerPoint, Outlook or ITSM products\n\nProficient with Apple products (Mac, Ipad,Iphone)\n\nExperience:\n\nAssociates Degree in Computer Science, related field or equivalent experience\n\nMinimum 5 years Desktop Support experience, preferably within a financial services organization.\n\nSpecial Job Requirements:\n\nFlexible hours\n\nBank holidays\n\nOccasional afterhours and weekend work as needed.\n\nCompetencies:\n\nCustomer Service – Strives for high levels of customer satisfaction. Going out of our way to be helpful and pleasant to our customers.\n\nEfficiency – Plans ahead, manages time efficiently, is punctual, is cost conscious and is constantly thinking of better ways to do things.\n\nQuality of Work - Pays attention to detail, checks own work for accuracy and quality and takes personal responsibility for achieving quality standards. Sets goals and targets for self which improve upon previous performance and constantly strive to exceed existing quality and service standards.\n\nTeamwork - Works sensitively with others and shares openly information and knowledge with the appropriate people at the right time. Encourages a co-operative team approach to handle workloads and overcome difficulties and maintains continuous dialogue with unit members as appropriate.\n\nThe hourly rate is between $ 24 and $ 30 per hour, and the anticipated annual base compensation range for this position will be $ 60,000 to $ 75,000, inclusive of required overtime. The actual rate will be determined on an individualized basis taking into account a wide range of factors including, but not limited to, relevant skills, experience, education, and, where applicable, licenses or certifications held. In addition to base salary and a competitive benefits package, this position may be eligible for additional types of compensation including discretionary bonuses and other short- and long-term incentives (e.g., deferred cash, equity, etc.).\n\nShow less\nSee company reviews"
    },
    {
        "title": "Construction Administrative Assistant",
        "Company_name": "Walker Ridge Construction",
        "location": "New York, NY",
        "salaryEst": "$27.24/hr (Employer est.)",
        "description": "Overview\nWe are seeking a motivated and organized Administrative Assistant to join our team. This role is essential for ensuring the smooth progress of our construction projects and providing administrative support to the project managers.\n\nDuties and responsibilities\n\nScheduling meetings, appointments, and project deadlines for the project team and stakeholders.\nMaintaining and updating project documents, including project plans, reports, presentations, and meeting minutes.\nHandling incoming and outgoing project-related communication, including emails, phone calls, and correspondence.\nMonitoring project timelines and milestones, updating project management tools with progress reports.\nAssisting with project budget monitoring and expense reporting.\nPreparing agendas, taking meeting minutes, and distributing follow-up action items.\nMaintaining communication with project stakeholders, including clients, vendors, and internal team members.\nEntering project data into relevant systems and generating reports as needed.\nOrganizing and maintaining project files both electronically and physically.\n\nSkills\n\nExcellent organizational skills: ability to manage multiple tasks and prioritize effectively under tight deadlines.\nStrong communication skills: clear and concise communication both verbally and in writing with various stakeholders.\nAttention to detail: ability to maintain accuracy in data entry and document management.\nTeamwork and collaboration: ability to work effectively with project teams and support their needs.\nTechnical skills: proficient in Microsoft Office Suite (Word and Excel), knowledge in Procore Construction Software\n\nEducation / Experience\n\nBachelor's degree or college diploma in construction project management or business administration is preferred, recent graduates are welcomed. Some related experience is a plus.\n\nJob Type: Full-time\n\nPay: From $27.24 per hour\n\nSchedule:\n\n8 hour shift\n\nAbility to Commute:\n\nNew York, NY 10012 (Required)\n\nAbility to Relocate:\n\nNew York, NY 10012: Relocate before starting work (Required)\n\nWork Location: In person\n\nShow less"
    },
    {
        "title": "Store Associate",
        "Company_name": "CVS Health",
        "location": "New York, NY",
        "salaryEst": "$16.50 – $22.00/hr (Employer est.)",
        "description": "At CVS Health, we’re building a world of health around every consumer and surrounding ourselves with dedicated colleagues who are passionate about transforming health care.\n\nAs the nation’s leading health solutions company, we reach millions of Americans through our local presence, digital channels and more than 300,000 purpose-driven colleagues – caring for people where, when and how they choose in a way that is uniquely more connected, more convenient and more compassionate. And we do it all with heart, each and every day.\n\nPosition Summary\n\nRetail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we’re shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person’s unique healthcare needs. Join our team of thousands as we positively impact millions…one customer at a time.\n\nThe Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.\n\nEssential Functions:\n\n\n\n\nProviding differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues\nFocusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed\nAccurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures\nMaintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager\nSupporting opening and closing store activities, when needed\nProviding customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools\nAssisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development\nEmbracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health\nRequired Qualifications\nAt least 16 years of age\n\nPhysical Requirements:\n\nRemaining upright on the feet, particularly for sustained periods of time\nLifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting\nVisual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details\n\nPreferred Qualifications\nPrevious experience in a retail or customer service setting\n\nEducation\n\nHigh School diploma or equivalent preferred but not required.\n\nAnticipated Weekly Hours\n\n40\n\nTime Type\n\nFull time\n\nPay Range\n\nThe typical pay range for this role is:\n\n$16.50 - $22.00\n\nThis pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.\n\n\nOur people fuel our future. Our teams reflect the customers, patients, members and communities we serve and we are committed to fostering a workplace where every colleague feels valued and that they belong.\n\nGreat benefits for great people\n\nWe take pride in our comprehensive and competitive mix of pay and benefits – investing in the physical, emotional and financial wellness of our colleagues and their families to help them be the healthiest they can be. In addition to our competitive wages, our great benefits include:\n\nAffordable medical plan options, a 401(k) plan (including matching company contributions), and an employee stock purchase plan.\n\nNo-cost programs for all colleagues including wellness screenings, tobacco cessation and weight management programs, confidential counseling and financial coaching.\n\nBenefit solutions that address the different needs and preferences of our colleagues including paid time off, flexible work schedules, family leave, dependent care resources, colleague assistance programs, tuition assistance, retiree medical access and many other benefits depending on eligibility.\n\nFor more information, visit https://jobs.cvshealth.com/us/en/benefits\n\nWe anticipate the application window for this opening will close on: 06/16/2025\n\nQualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state and local laws.\n\nShow more\nSee company reviews"
    },
    {
        "title": "Store Associate",
        "Company_name": "CVS Health",
        "location": "New York, NY",
        "salaryEst": "$16.50 – $22.00/hr (Employer est.)",
        "description": "At CVS Health, we’re building a world of health around every consumer and surrounding ourselves with dedicated colleagues who are passionate about transforming health care.\n\nAs the nation’s leading health solutions company, we reach millions of Americans through our local presence, digital channels and more than 300,000 purpose-driven colleagues – caring for people where, when and how they choose in a way that is uniquely more connected, more convenient and more compassionate. And we do it all with heart, each and every day.\n\nPosition Summary\n\nRetail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we’re shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person’s unique healthcare needs. Join our team of thousands as we positively impact millions…one customer at a time.\n\nThe Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.\n\nEssential Functions:\n\n\n\n\nProviding differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues\nFocusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed\nAccurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures\nMaintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager\nSupporting opening and closing store activities, when needed\nProviding customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools\nAssisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development\nEmbracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health\nRequired Qualifications\nAt least 16 years of age\n\nPhysical Requirements:\n\nRemaining upright on the feet, particularly for sustained periods of time\nLifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting\nVisual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details\n\nPreferred Qualifications\nPrevious experience in a retail or customer service setting\n\nEducation\n\nHigh School diploma or equivalent preferred but not required.\n\nAnticipated Weekly Hours\n\n40\n\nTime Type\n\nFull time\n\nPay Range\n\nThe typical pay range for this role is:\n\n$16.50 - $22.00\n\nThis pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.\n\n\nOur people fuel our future. Our teams reflect the customers, patients, members and communities we serve and we are committed to fostering a workplace where every colleague feels valued and that they belong.\n\nGreat benefits for great people\n\nWe take pride in our comprehensive and competitive mix of pay and benefits – investing in the physical, emotional and financial wellness of our colleagues and their families to help them be the healthiest they can be. In addition to our competitive wages, our great benefits include:\n\nAffordable medical plan options, a 401(k) plan (including matching company contributions), and an employee stock purchase plan.\n\nNo-cost programs for all colleagues including wellness screenings, tobacco cessation and weight management programs, confidential counseling and financial coaching.\n\nBenefit solutions that address the different needs and preferences of our colleagues including paid time off, flexible work schedules, family leave, dependent care resources, colleague assistance programs, tuition assistance, retiree medical access and many other benefits depending on eligibility.\n\nFor more information, visit https://jobs.cvshealth.com/us/en/benefits\n\nWe anticipate the application window for this opening will close on: 06/16/2025\n\nQualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state and local laws.\n\nShow less\nSee company reviews"
    },
    {
        "title": "Research Assistant | Laboratory of Cell Cycle Genetics",
        "Company_name": "Rockefeller University",
        "location": "New York, NY",
        "salaryEst": "$50K – $55K/yr (Employer est.)",
        "description": "Organization Overview: We work on the cell cycle using budding yeast as a model system. We are collaborating to construct ordinary differential equation-based models for control of the yeast cell cycle,and to test these models genetically and biochemically. We are engaged in a combined biochemical and genetic screen for binding partners and phosphorylation targets specific to different cyclin-Cdk complexes. We plan a combined computational and molecular approach to analysis of promoter elements important in both the mitotic and meiotic cell cycles. Overview:\nThe overall purpose of the project is to search for broadly cross-reactive single-chain antibodies against viruses in the coronavirus family. Specifically the work will consist of assisting in: construction of libraries of yeast expressing single-chain antibodies against multiple viral antigens in the coronavirus family; screening the libraries for binding and cross-binding to antigens from related viruses; DNA preparation and analysis of next-generation sequencing data to determine sequences and specificities of cross-binding vs. specific antibodies.\nResponsibilities:\nResponsibilities include:\nPrepare plasmid and PCR-generated DNA for construction of yeast libraries\nCarry out high-efficiency yeast transformation to generate complex libraries\nSelect differential binding clones using magnetic bead technology\nPurify DNA from selected populations, prepare for next-generation sequencing\nAid with biochemical and structural characterization of resultant single-chain antibodies\nPerform related duties and responsibilities as assigned/requested\nQualifications:\nBachelor of Science degree with basic laboratory experience is required. Specific experience in molecular biology and microbiology (DNA preparation and analysis, media preparation, microbial culture) is strongly preferred.\n\nThe Rockefeller University is an equal opportunity employer – veterans/individuals with disabilities. Qualified applicants will receive consideration for employment without regard to characteristics protected by applicable local, state, or federal law, including but not limited to disability and protected veteran status.\n\nThe salary of the finalist selected for this role will be set based on various factors, including but not limited to organizational budgets, qualifications, experience, education, licenses, specialty, and training. The hiring range provided represents The Rockefeller University's good faith and reasonable estimate of the range of possible compensation at the time of posting.\nCompensation Range: Min: USD $50,000.00/Yr. Compensation Range: Max: USD $55,000.00/Yr.\nShow less\nSee company reviews"
    },
    {
        "title": "Mailroom Clerk/Receptionist",
        "Company_name": "ZAHRA CONSTRUCTION CONSULTANTS",
        "location": "New York, NY",
        "salaryEst": "$20.00 – $21.20/hr (Employer est.)",
        "description": "Job Description:\n\nWe are seeking an organized and professional Mailroom Clerk/Receptionist to join our team. This dual-role position requires a dependable individual who can handle mailroom operations while providing exceptional front desk reception services.\n\nKey Responsibilities:\n\n- Sort and distribute incoming mail and packages promptly and accurately.\n\n- Prepare outgoing mail, including packaging, labeling, and coordinating with delivery services.\n\n- Maintain inventory of mailroom supplies and place orders as needed.\n\n- Monitor and ensure proper operation of mailroom equipment.\n\n- Greet and welcome visitors in a courteous and professional manner.\n\n- Answer and direct incoming calls to the appropriate staff or department.\n\n- Manage the front desk area to maintain a tidy and organized appearance.\n\n- Schedule and coordinate appointments or meetings.\n\nQualifications:\n\n- High school diploma or equivalent.\n\n- Previous experience in a mailroom or receptionist role is preferred.\n\n- Strong organizational and multitasking skills.\n\n- Excellent verbal and written communication abilities.\n\n- Proficient in using office equipment and basic computer programs (e.g., MS Office).\n\n- Professional demeanor and a friendly attitude.\n\n- Ability to lift and move packages up to 40 pounds.\n\nJob Type: Full-time\n\nPay: $20.00 - $21.20 per hour\n\nBenefits:\n\n401(k)\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\nDay shift\nMonday to Friday\n\nWork Location: In person\n\nShow more"
    },
    {
        "title": "Front Desk Receptionist",
        "Company_name": "Medease care",
        "location": "Brooklyn, NY",
        "salaryEst": "$25.00/hr (Employer est.)",
        "description": "Job Summary\nWe are seeking a dedicated and professional Front Desk Receptionist to join our team. The ideal candidate will serve as the first point of contact for our clients and visitors, providing exceptional customer support while managing various administrative tasks. This role requires excellent communication skills, strong time management abilities, and a friendly demeanor to create a welcoming environment.\n\nDuties\n\nGreet and assist clients and visitors in a courteous and professional manner. (all over the phone)\nManage phone systems, including answering calls, transferring calls, and taking messages.\nSchedule appointments and maintain the front desk calendar efficiently.\nProvide administrative support by organizing files, proofreading documents, and ensuring accuracy in all communications.\nMaintain cleanliness and organization of the front desk area.\nHandle incoming mail and packages, distributing them to appropriate personnel.\nAssist with various personal assistant tasks to support management as required.\nDemonstrate computer literacy by effectively using office software and other digital tools.\n\nQualifications\n\nProven experience in a front desk or receptionist role is preferred.\nStrong customer support skills with a focus on client satisfaction.\nExcellent time management skills to prioritize tasks effectively.\nProficiency in QuickBooks is a plus but not mandatory.\nFamiliarity with phone systems and professional phone etiquette.\nStrong proofreading abilities to ensure high-quality documentation.\nHigh level of computer literacy with knowledge of common office software applications.\nAbility to work independently while being part of a team-oriented environment.\nA positive attitude and strong interpersonal skills are essential for success in this role.\n\nJob Type: Full-time\n\nPay: $25.00 per hour\n\nBenefits:\n\nPaid time off\n\nSchedule:\n\n8 hour shift\n\nAbility to Relocate:\n\nBrooklyn, NY 11219: Relocate before starting work (Required)\n\nWork Location: In person\n\nShow less"
    },
    {
        "title": "ED Associate",
        "Company_name": "Northwell Health",
        "location": "New York, NY",
        "salaryEst": "$25.76 – $27.98/hr (Employer est.)",
        "description": "Job Description\n\nRegisters patients to ensure data collected is correct for the purpose of hospital record and billing. Performs clerical and communication functions for optimal operation of department. Coordinates activities with other departments. Functions as a receptionist to greet and assist guests entering the unit. Serves as a primary resource in providing information and facilitating services in the Emergency Department. Performs patient registration, billing, exit and clerical support activities.\n\nJob Responsibility\n\nPerforms admission/registration, pre-admission/pre-registration, and co-pay collection process and financial functions.\nPerforms reception functions.\nPerforms Order Entry functions.\nPerforms collection functions\nServes as a backup to other staff members (escorting patients to other areas, delivering medical records to other areas, obtaining test results, etc.), as required. Serves as a primary resource in providing information and facilitating services in the Emergency Department.\nGreets patients, visitors and employees to the Emergency Department and overall facility in a courteous and friendly manner.\nAssists medical staff, other hospital departments, physicians, affiliates, patients and their families with requests for information and services.\nProvides interpretation of regulations to patients (i.e visiting hours, patient services, etc.).\nProvides information regarding facility regulations and services.\nAnswers telephone calls and takes messages, responding with appropriate department protocol.\nProvides facility rules and regulations, upon request.\nPerforms administrative functions to facilitate patient registration.\nInterviews patients/significant others and obtains all relevant demographic and insurance data.\nObtains necessary signatures and makes copies of relevant documentation.\nMaintains current knowledge of changes in regulations, or policies and procedures, with regard to insurance requirements, hospital policies, etc.\nEnsures patients are charged for all services accordingly and initiates corrective action, as needed. Codes insurance carriers and other system information.\nAccurately documents all required information in department log book or computer log.\nAssigns on-line account numbers\nCommunicates with Medical Records to see if patient has an existing account number.\nPrepares and maintains patient chart packages. Prepares chart package to include chart, triage note, ED identification card, labels and visitor pass.\nEnsures charts are available for medical staff in a timely manner.\nReviews ED census with copies of charts that are collected after services are rendered.\nReviews and ensures charts are accurately documented and completed after services are rendered.\nDocuments charges and payment data and ensures charts are accurately coded and prepared for billing.\nPrepares charts for transfer to Data Processing. Performs chart break down for billing, filing and/or transfer to Medical Records.\nManages department on-call systems.\nPages and contacts medical personnel, physicians, laboratory, etc.\nAssists staff, affiliated physicians and patients/family members acquire needed information, contacts or services.\nInitiates Disaster Plan, when necessary.\nUtilizes reference lists for referrals when requested.\nSubmits laboratory test orders, as required. Receives and documents results.\nProcesses orders as instructed, ensuring proper labeling of specimens and timely transport to lab.\nNotifies medical staff of test results in a timely manner.\nMaintains accurate records of orders submitted and follows up with outside departments for results. Ensures results are documented in patient chart.\nPerforms general clerical duties to promote efficient functioning of department.\nResponsible for maintaining accurate and efficient records.\nLocates, sorts and files needed information, materials or records and paperwork, both medical and general.\nRoutinely operates office equipment.\nAnswers telephone and receives visitors in a courteous manner, as required.\nPerforms related duties as required.\nADA Essential Functions\n\nJob Qualification\n\nHigh School Diploma or equivalent, required.\nMinimum of six (6) months registration experience in hospital or related healthcare setting, required.\nTyping 20 wpm, required.\nAbility to use general office equipment, required.\nGood verbal and written communication skills, required.\n\n\n\n\nAdditional Salary Detail\nThe salary range and/or hourly rate listed is a good faith determination of potential base compensation that may be offered to a successful applicant for this position at the time of this job advertisement and may be modified in the future.When determining a team member's base salary and/or rate, several factors may be considered as applicable (e.g., location, specialty, service line, years of relevant experience, education, credentials, negotiated contracts, budget and internal equity).\nShow less\nSee company reviews"
    },
    {
        "title": "Legislative Fellow",
        "Company_name": "New York City Council",
        "location": "New York, NY",
        "salaryEst": "$45K/yr (Employer est.)",
        "description": "The New York City Council Fellows Program is a one-year paid fellowship for individuals who want to pursue a rewarding career in local government. The program provides Fellows with a unique opportunity to work in one of the most diverse and exciting cities in the country. With Council Member district offices in each New York City borough and centralized support divisions located in downtown Manhattan, Fellows will participate in many vibrant programs and impactful service-oriented initiatives in both locations.\n\nThis fellowship will provide up-close experience in legislative operations, community engagement projects, Council events, capital programs, participatory budgeting, public policy and more, helping us to shape the next generation of New York City government leaders.\n\nFellows Program Year: October 6, 2025 to September 25, 2026\n\nSALARY RANGE:\n\n$45,000 to $45,000\n\nQUALIFICATIONS:\n\nAbility to commit full-time to the one-year fellowship.\nMust have completed a bachelor’s degree prior to September 1, 2025.\nMust be able to demonstrate their eligibility to work in the United States after graduation and for the entire fellowship period.\nPrior experience in activism, community organizing, development or participation in social movements helpful.\nDemonstrated proficiency in both written and spoken English.\nExcellent interpersonal, verbal and written communication skills.\nStrong time and task management skills.\nWorking knowledge of computers and related software.\nHighly motivated and independent, yet team oriented.\n\nADDITIONAL INFORMATION:\n\nNew York City residency required within 90 days of appointment.\n\nHealth, dental and vision insurance coverage are offered upon appointment. Retirement plans, deferred compensation plans, group life insurance, paid time off and paid holidays, training resources, health & fitness reimbursement and wellness programs are also available.\n\nThe New York City Council makes reasonable accommodations for applicants and employees with disabilities. If reasonable accommodation is needed to participate in the job application or interview process, please contact EEOOfficer@council.nyc.gov.\n\nHOW TO APPLY:\n\nQualified candidates should forward their cover letters and resumes by March 28, 2025:\n\nE-MAIL: NYCCAPPLY@council.nyc.gov\n\nMAIL: New York City Council\n\nAttn: Personnel Services/Recruiting (Fellow)\n\n250 Broadway, 26th Floor\n\nNew York, New York 10007\n\nFAX: 12124014711\n\nWhile we sincerely appreciate all applications, only those candidates selected for an interview will be contacted.\n\nThe New York City Council is an inclusive equal opportunity employer committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, veteran status, gender identity, or pregnancy.\n\nJob Type: Full-time\n\nPay: $45,000.00 per year\n\nSchedule:\n\nMonday to Friday\n\nAbility to Relocate:\n\nNew York, NY 10007: Relocate before starting work (Required)\n\nWork Location: In person\n\nShow less\nSee company reviews"
    },
    {
        "title": "Store Associate",
        "Company_name": "CVS Health",
        "location": "Brooklyn, NY",
        "salaryEst": "$16.50 – $22.00/hr (Employer est.)",
        "description": "At CVS Health, we’re building a world of health around every consumer and surrounding ourselves with dedicated colleagues who are passionate about transforming health care.\n\nAs the nation’s leading health solutions company, we reach millions of Americans through our local presence, digital channels and more than 300,000 purpose-driven colleagues – caring for people where, when and how they choose in a way that is uniquely more connected, more convenient and more compassionate. And we do it all with heart, each and every day.\n\nPosition Summary\n\n\nRetail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we’re shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person’s unique healthcare needs. Join our team of thousands as we positively impact millions…one customer at a time.\n\nThe Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.\n\nEssential Functions:\n\n\n\nProviding differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues\n\nFocusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed\n\nAccurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures\n\nMaintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager\n\nSupporting opening and closing store activities, when needed\n\nProviding customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools\n\nAssisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development\n\nEmbracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health\n\nRequired Qualifications\n\nAt least 16 years of age\n\nPhysical Requirements:\n\nRemaining upright on the feet, particularly for sustained periods of time\n\nLifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting\n\nVisual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details\n\nPreferred Qualifications\n\nPrevious experience in a retail or customer service setting\n\nEducation\n\nHigh School diploma or equivalent preferred but not required.\n\nAnticipated Weekly Hours\n\n40\n\nTime Type\n\nPart time\n\nPay Range\n\nThe typical pay range for this role is:\n\n$16.50 - $22.00\n\nThis pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.\n\n\nOur people fuel our future. Our teams reflect the customers, patients, members and communities we serve and we are committed to fostering a workplace where every colleague feels valued and that they belong.\n\nGreat benefits for great people\n\nWe take pride in our comprehensive and competitive mix of pay and benefits – investing in the physical, emotional and financial wellness of our colleagues and their families to help them be the healthiest they can be. In addition to our competitive wages, our great benefits include:\n\nAffordable medical plan options, a 401(k) plan (including matching company contributions), and an employee stock purchase plan.\n\nNo-cost programs for all colleagues including wellness screenings, tobacco cessation and weight management programs, confidential counseling and financial coaching.\n\nBenefit solutions that address the different needs and preferences of our colleagues including paid time off, flexible work schedules, family leave, dependent care resources, colleague assistance programs, tuition assistance, retiree medical access and many other benefits depending on eligibility.\n\nFor more information, visit https://jobs.cvshealth.com/us/en/benefits\n\nWe anticipate the application window for this opening will close on: 06/16/2025\n\nQualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state and local laws.\n\nShow less\nSee company reviews"
    },
    {
        "title": "Data Entry/Cleanup Clerk",
        "Company_name": "Law Offices of Michael S. Lamonsoff",
        "location": "New York, NY",
        "salaryEst": "$20.00 – $22.00/hr (Employer est.)",
        "description": "Job Summary\nWe are seeking a detail-oriented and organized Data Entry Clerk to join our team. The ideal candidate will be responsible for accurately entering and managing data within our systems, ensuring that information is up-to-date and easily accessible. This role is crucial for maintaining the integrity of our databases and supporting various departments through efficient data management.\n\nDuties\n\nReview and clean up case files, ensuring all client information, legal documents, and case details are accurately entered and properly stored.\nIdentify and correct discrepancies, errors, or missing information in the firm's database..\nOrganize and categorize of data entry and ensure compliance with legal and regulatory standards .\nVerify accuracy and consistency of data entry.\nPerform data maintenance tasks, including merging duplicate entries and archiving outdated information.\nCollaborate with team members to identify areas for process improvement in data management practices.\nAssist in generating reports from databases as required by management or other departments.\n\nRequirements\n\nHigh school diploma or equivalent required; associate's degree preferred.\nPrior experience in data entry, administrative support, or a legal office environment is highly preferred.\nFamiliarity with case management software and databases. Experience with Smart Advocate is a plus.\nStrong attention to detail with the ability to identify errors and inconsistencies.\nExcellent organizational and time management skills.\nStrong written and verbal communication skills.\nAbility to handle sensitive information with discretion and professionalism.\n\nIf you are passionate about data management and possess the necessary skills, we encourage you to apply for this exciting opportunity as a Data Entry Clerk.\n\nJob Types: Full-time, Temporary\n\nPay: $20.00 - $22.00 per hour\n\nExpected hours: 40 per week\n\nSchedule:\n\n8 hour shift\n\nWork Location: In person\n\nShow more\nSee company reviews"
    },
    {
        "title": "Data Entry/Cleanup Clerk",
        "Company_name": "Law Offices of Michael S. Lamonsoff",
        "location": "New York, NY",
        "salaryEst": "$20.00 – $22.00/hr (Employer est.)",
        "description": "Job Summary\nWe are seeking a detail-oriented and organized Data Entry Clerk to join our team. The ideal candidate will be responsible for accurately entering and managing data within our systems, ensuring that information is up-to-date and easily accessible. This role is crucial for maintaining the integrity of our databases and supporting various departments through efficient data management.\n\nDuties\n\nReview and clean up case files, ensuring all client information, legal documents, and case details are accurately entered and properly stored.\nIdentify and correct discrepancies, errors, or missing information in the firm's database..\nOrganize and categorize of data entry and ensure compliance with legal and regulatory standards .\nVerify accuracy and consistency of data entry.\nPerform data maintenance tasks, including merging duplicate entries and archiving outdated information.\nCollaborate with team members to identify areas for process improvement in data management practices.\nAssist in generating reports from databases as required by management or other departments.\n\nRequirements\n\nHigh school diploma or equivalent required; associate's degree preferred.\nPrior experience in data entry, administrative support, or a legal office environment is highly preferred.\nFamiliarity with case management software and databases. Experience with Smart Advocate is a plus.\nStrong attention to detail with the ability to identify errors and inconsistencies.\nExcellent organizational and time management skills.\nStrong written and verbal communication skills.\nAbility to handle sensitive information with discretion and professionalism.\n\nIf you are passionate about data management and possess the necessary skills, we encourage you to apply for this exciting opportunity as a Data Entry Clerk.\n\nJob Types: Full-time, Temporary\n\nPay: $20.00 - $22.00 per hour\n\nExpected hours: 40 per week\n\nSchedule:\n\n8 hour shift\n\nWork Location: In person\n\nShow less\nSee company reviews"
    },
    {
        "title": "Data Entry Clerk",
        "Company_name": "Crown Field Services LLC",
        "location": "Brooklyn, NY",
        "salaryEst": "$20.00 – $25.00/hr (Employer est.)",
        "description": "Crown Field Services, a Property Management and Preservation Company, seeks to expand the preservation team. The Data Entry Clerk will assist the preservation manager in directing the field vendors ensuring the timely completion of assigned jobs. A successful applicant will be thorough and detailed oriented and great with deadlines. This position is available immediately for the right candidate. If you are interested and have the relevant experience, please apply!\n\nResponsibilities include:\n\nEditing/Updating work orders.\nAssigning Work Orders to Vendors.\nQuality control of work done by vendors.\nTimely completion of work orders\nOpen to other tasks as needed\n\nQualifications:\n\nProficiency in Excel & PowerPoint.\n1-3 years of experience working with contractors or Vendors preferred.\nExceptional verbal and written communication skills.\nFamiliarity with property damages is a plus.\nProperty Preservation, REO, Cost Estimate, Xactimate and HUD Guideline experience a plus.\n\nJob Info:\n\nM-F 10 am - 6 pm.\n\nMany opportunities to grow within the company.\n\nOpen door policy.\n\nCompensation:\n\nPTO: Holiday, Sick, Vacation, Birthdays off.\n\nMedical, Dental, Vision.\n\n401k with company match!\n\nOptional work from home Fridays!\n\nPaid Lunch.\n\nSnack & Coffee Bar.\n\nJob Type: Full-time\n\nPay: $20.00 - $25.00 per hour\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nExperience:\n\nVendor management: 1 year (Preferred)\nProperty Preservation: 1 year (Preferred)\nOffice: 1 year (Required)\nCustomer service: 1 year (Preferred)\n\nWork Location: In person\n\nShow more\nSee company reviews"
    },
    {
        "title": "Office Coordinator-77262-BIMG-001",
        "Company_name": "Mount Sinai",
        "location": "New York, NY",
        "salaryEst": "$16.50 – $28.44/hr (Employer est.)",
        "description": "Description\n\nCoordinates the day to day clerical/secretarial operations in the assigned departments\n\n\nResponsibilities\n\n1. Collects patient and insurance information and documents on form\n\n2. Obtains insurance verification, insurance certification and authorization with number of visits allowed\n\n3. Prepares patient’s record for therapists, keeping all information confidential\n\n4. Enters patient confidential information into the spectra-soft computer system and eagle\n\n5. Prepares confidential records and forms as per the department’s policies and procedures\n\n6. Deals discreetly with large amounts of sensitive, confidential information concerning hospital affairs, information in minutes, letters and other documents\n\n7. Obtains medical records, reports, etc., for therapists\n\n8. Coordinates/prepares daily sign in sheets/schedule, this includes verifying schedules\n\n9. Assists with typing/ word processing projects in the event of secretarial/staffing shortages\n\n10. Manages/maintains inventory of office supplies\n\n11. Assists with the budget preparation\n\n12. Assists with the sorting and distribution of mail and other documents\n\n13. Collects appropriate cash, issues receipts and reconciles cash\n\n14. Creates systems for department files, including the organization of patient chart files\n\n15. Composes correspondence, memos, minutes, and reports of meetings\n\n16. Oversees that all patients are called back within working day schedules follow ups and reconciles charge tickets\n\n17. Coordinates the preparation of daily charge tickets/vouchers insuring the proper information is includes. This information includes the patients name, account/case number, hospital registration code, patient’s diagnosis, insurance carrier, ICD9 codes, etc\n\n18. Assists with and oversees that the batching /coding for each voucher is done daily and delivers them to their designated area. Reconciliation log kept\n\n\nEmployer Description\n\nStrength through Unity and Inclusion\n\nThe Mount Sinai Health System is committed to fostering an environment where everyone can contribute to excellence. We share a common dedication to delivering outstanding patient care. When you join us, you become part of Mount Sinai’s unparalleled legacy of achievement, education, and innovation as we work together to transform healthcare. We encourage all team members to actively participate in creating a culture that ensures fair access to opportunities, promotes inclusive practices, and supports the success of every individual. This includes advocating for equitable policies, addressing barriers that limit potential, and standing in solidarity with colleagues who face unfair treatment.\n\nAt Mount Sinai, our leaders are committed to fostering a workplace where all employees feel valued, respected, and empowered to grow. We strive to create an environment where collaboration, fairness, and continuous learning drive positive change, improving the well-being of our staff, patients, and organization. Our leaders are expected to challenge outdated practices, promote a culture of respect, and work toward meaningful improvements that enhance patient care and workplace experiences. We are dedicated to building a supportive and welcoming environment where everyone has the opportunity to thrive and advance professionally. Explore this opportunity and be part of the next chapter in our history.\n\nAbout the Mount Sinai Health System:\n\nMount Sinai Health System is one of the largest academic medical systems in the New York metro area, with more than 48,000 employees working across eight hospitals, more than 400 outpatient practices, more than 300 labs, a school of nursing, and a leading school of medicine and graduate education. Mount Sinai advances health for all people, everywhere, by taking on the most complex health care challenges of our time — discovering and applying new scientific learning and knowledge; developing safer, more effective treatments; educating the next generation of medical leaders and innovators; and supporting local communities by delivering high-quality care to all who need it. Through the integration of its hospitals, labs, and schools, Mount Sinai offers comprehensive health care solutions from birth through geriatrics, leveraging innovative approaches such as artificial intelligence and informatics while keeping patients’ medical and emotional needs at the center of all treatment. The Health System includes more than 9,000 primary and specialty care physicians; 13 joint-venture outpatient surgery centers throughout the five boroughs of New York City, Westchester, Long Island, and Florida; and more than 30 affiliated community health centers. We are consistently ranked by U.S. News & World Report's Best Hospitals, receiving high \"Honor Roll\" status, and are highly ranked: No. 1 in Geriatrics, top 5 in Cardiology/Heart Surgery, and top 20 in Diabetes/Endocrinology, Gastroenterology/GI Surgery, Neurology/Neurosurgery, Orthopedics, Pulmonology/Lung Surgery, Rehabilitation, and Urology. New York Eye and Ear Infirmary of Mount Sinai is ranked No. 12 in Ophthalmology. U.S. News & World Report’s “Best Children’s Hospitals” ranks Mount Sinai Kravis Children's Hospital among the country’s best in several pediatric specialties. The Icahn School of Medicine at Mount Sinai is ranked No. 11 nationwide in National Institutes of Health funding and in the 99th percentile in research dollars per investigator according to the Association of American Medical Colleges. Newsweek’s “The World’s Best Smart Hospitals” ranks The Mount Sinai Hospital as No. 1 in New York and in the top five globally, and Mount Sinai Morningside in the top 20 globally.\n\nEqual Opportunity Employer Minorities/Women/Disabled/Veterans\n\nThe Mount Sinai Health System is an equal opportunity employer, complying with all applicable federal civil rights laws. We do not discriminate, exclude, or treat individuals differently based on race, color, national origin, age, religion, disability, sex, sexual orientation, gender, veteran status, or any other characteristic protected by law. We are deeply committed to fostering an environment where all faculty, staff, students, trainees, patients, visitors, and the communities we serve feel respected and supported. Our goal is to create a healthcare and learning institution that actively works to remove barriers, address challenges, and promote fairness in all aspects of our organization.\n\n\nCompensation\n\nThe Mount Sinai Health System (MSHS) provides a salary range to comply with the New York City Law on Salary Transparency in Job Advertisements. The salary range for the role is $16.5 - $28.4386 Hourly. Actual salaries depend on a variety of factors, including experience, education, and hospital need. The salary range or contractual rate listed does not include bonuses/incentive, differential pay or other forms of compensation or benefits.\n\nShow less\nSee company reviews"
    },
    {
        "title": "Jr. Research Scientist",
        "Company_name": "New York University",
        "location": "New York, NY",
        "salaryEst": "$18.00 – $26.00/hr (Employer est.)",
        "description": "New York University: NYU - NY: Steinhardt School of Culture, Education and Human Development: Office of Research: Researchers_AP\nLocation\nNew York, NY\nOpen Date\nNov 09, 2024\nDescription\n\nNew York University Prison Education Program - College-in-Prison Project Coordinator\n\nAssist faculty director and associate director of NYU’s Prison Education Program with daily operations of degree programming at Wallkill Correctional Facility. Duties include:\n\nCoordinate Department of Corrections clearance paperwork - new volunteer approval and trimester updates (TB, Webex forms)\nSupport Course Materials production for incarcerated students - course reader development and ordering books and supplies each trimester\nAssist with printing, copying, sorting, and addressing communications to students, including regular transcript download, enrollment and course materials letters, student homework assignments, and other messages for distribution at Wallkill\nOrganize hard and softcopy materials for annual AA and BA application and interview processes\nCreate required documentation for Wallkill (Commissary schedules, DIN rosters, etc) in various hardcopy and softcopy formats\nCreate accessible student hardcopy resources for the NYU library (book lists, NYU major guides, request forms, etc.), including Bridge and Cont Ed materials.\nSupport with documents, including scanning and copying student artwork for installation, Mailing copies of CW&P and GR to student families, Scanning and copying student diplomas and mailing documents and regalia to families, etc\nSupport the annual Graduation ceremony: supplies, WSQ logistics, vendors, and communications.\nFiling external transcript and records requests- - GED/HS Dip for new students, college transcripts for BA students, and obtaining and sending hardcopy and official.\nNYU transcripts externally on request\nUpdate new cohort information from Applications and maintain degree audits and academic record-keeping in collaboration with SD.\nProcess student name change requests and data corrections\nManages transportation logistics and communications for faculty and staff traveling to Wallkill\n\nFormal and informal evaluations will be used, including regular check-ins and one-on-one meetings with supervisors, provision of regular feedback on progress and goal areas, strategizing areas for improvement, and troubleshooting emerging challenges.\n\nThe job duties for this position are highly local in nature and require onsite presence to be performed.\n\nIn compliance with NYC’s Pay Transparency Act, the salary range for this position is $18 - $26. When extending an offer, New York University considers factors such as (but not limited to) the specific grant funding and the terms of the research grant.\n\nQualifications\nExcellent organizational skills;\nExperience executing detail-oriented and time-sensitive tasks\nStrong written and interpersonal communication skills.\nApplication Instructions\n\nPlease submit a resume and cover letter.\n\nShow less\nSee company reviews"
    },
    {
        "title": "Open Inquiry",
        "Company_name": "Elsewhere Brooklyn",
        "location": "Brooklyn, NY",
        "salaryEst": "$16.00 – $30.00/hr (Employer est.)",
        "description": "If you don't see the job you want to apply for...\n\n\nWe're always on the lookout for talented individuals to join our team. If you're interested in a career with us, we encourage you to send us your resume and a brief introduction.\n\n\nAbout the Companies:\n\nElsewhere is a multi-room Brooklyn music venue and nightclub built by and for the culture-obsessed, managed by our sister promotions company PopGun Presents - an events collective with deep roots in NYC's emerging music community. We are here to empower artists, celebrate the diversity of our city, widen access to visionary and uplifting culture, and experience the joy of doing it all together.\n\nIf you share our passion for music and art without boundaries, and you're looking for the challenge of your career, we want to connect with you - join us and grow with one of the best teams in independent arts, hospitality, events, and culture.\n\n\nYou’ll love your time at Elsewhere because…\n\nWe believe in what we do, and foster a culture of respect (for all music & people), passion, and excellence\nYou will work with teammates that are the best in the culture & events business\nYou will be on the cutting edge of music, enabling emerging culture to thrive\n\nWe are building a long-term business, that can support long-term careers in our industry\n\n\nElsewhere’s Values\n\nThese values are real and guide all of our decisions in how we operate and how we treat people. This includes our decisions to hire, reward, and fire. Every single person at Elsewhere will be held to these standards. This is how we build a great team, achieve our goals, and do so enjoyably.\n\nINCLUSIVITY\n\nElsewhere is a haven for our staff, artists, and audiences to experience the joy of expressing their authentic selves. Everybody has the right to feel welcomed and understood here, in direct defiance of all the ways our society tries to divide us up out there. We crave connectivity and togetherness. We’re curious about the unknown.\n\nOPTIMISM\n\nThe chills we get experiencing transcendent music in a crowd remind us that a better world is possible. Elsewhere is a celebration of that feeling - of joy, wonder, and hope. We are here to have fun, and we reject cynicism in all its forms.\n\nRESPECT\n\nOur love for the game comes from a place of deep respect: for the extraordinary history of music and nightlife in NYC, for the working artists out there redefining culture, and for our staff who live and breathe it every night. To do right, we extend that respect to each other and everyone else along the journey.\n\nKINDNESS\n\nOur job means service: to our teammates, artists, customers, community, city, and to the culture. We can’t do this without being kind to ourselves, to each other, to our artists, to our audiences, and to our community. Be understanding, empathetic, go out of your way to help people out, be friendly, generous, considerate. We celebrate individuality, but there is no place for selfishness or ego.\n\nINTEGRITY\n\nWe believe strong communities are built on trust, and so everyone must rely on us to be honest, transparent, and consistent. We live our values and stand by them even when it’s hard or inconvenient. We admit our mistakes and work to grow from them.\n\nPASSION\n\nThere are much easier ways to earn a living. The renewable resource that keeps our team sustained is an unshakable conviction in some aspect of our mission, whether it’s supporting new artists, helping audiences discover music, building community, or shifting culture.\n\nEXCELLENCE\n\nTo accomplish our goals we aim high, and work both hard and smart.\n\nCREATIVITY\n\nThe beauty of culture is that it is always evolving, and so should we. We value out-of- the-box thinking, challenging “the way things are,” and imaginative leaps. Like in art, it is better for us to fail trying something new than to not be experimenting in the first place.\n\nINDHEADOFFICE\nShow more\nSee company reviews"
    },
    {
        "title": "Open Inquiry",
        "Company_name": "Elsewhere Brooklyn",
        "location": "Brooklyn, NY",
        "salaryEst": "$16.00 – $30.00/hr (Employer est.)",
        "description": "If you don't see the job you want to apply for...\n\n\nWe're always on the lookout for talented individuals to join our team. If you're interested in a career with us, we encourage you to send us your resume and a brief introduction.\n\n\nAbout the Companies:\n\nElsewhere is a multi-room Brooklyn music venue and nightclub built by and for the culture-obsessed, managed by our sister promotions company PopGun Presents - an events collective with deep roots in NYC's emerging music community. We are here to empower artists, celebrate the diversity of our city, widen access to visionary and uplifting culture, and experience the joy of doing it all together.\n\nIf you share our passion for music and art without boundaries, and you're looking for the challenge of your career, we want to connect with you - join us and grow with one of the best teams in independent arts, hospitality, events, and culture.\n\n\nYou’ll love your time at Elsewhere because…\n\nWe believe in what we do, and foster a culture of respect (for all music & people), passion, and excellence\nYou will work with teammates that are the best in the culture & events business\nYou will be on the cutting edge of music, enabling emerging culture to thrive\n\nWe are building a long-term business, that can support long-term careers in our industry\n\n\nElsewhere’s Values\n\nThese values are real and guide all of our decisions in how we operate and how we treat people. This includes our decisions to hire, reward, and fire. Every single person at Elsewhere will be held to these standards. This is how we build a great team, achieve our goals, and do so enjoyably.\n\nINCLUSIVITY\n\nElsewhere is a haven for our staff, artists, and audiences to experience the joy of expressing their authentic selves. Everybody has the right to feel welcomed and understood here, in direct defiance of all the ways our society tries to divide us up out there. We crave connectivity and togetherness. We’re curious about the unknown.\n\nOPTIMISM\n\nThe chills we get experiencing transcendent music in a crowd remind us that a better world is possible. Elsewhere is a celebration of that feeling - of joy, wonder, and hope. We are here to have fun, and we reject cynicism in all its forms.\n\nRESPECT\n\nOur love for the game comes from a place of deep respect: for the extraordinary history of music and nightlife in NYC, for the working artists out there redefining culture, and for our staff who live and breathe it every night. To do right, we extend that respect to each other and everyone else along the journey.\n\nKINDNESS\n\nOur job means service: to our teammates, artists, customers, community, city, and to the culture. We can’t do this without being kind to ourselves, to each other, to our artists, to our audiences, and to our community. Be understanding, empathetic, go out of your way to help people out, be friendly, generous, considerate. We celebrate individuality, but there is no place for selfishness or ego.\n\nINTEGRITY\n\nWe believe strong communities are built on trust, and so everyone must rely on us to be honest, transparent, and consistent. We live our values and stand by them even when it’s hard or inconvenient. We admit our mistakes and work to grow from them.\n\nPASSION\n\nThere are much easier ways to earn a living. The renewable resource that keeps our team sustained is an unshakable conviction in some aspect of our mission, whether it’s supporting new artists, helping audiences discover music, building community, or shifting culture.\n\nEXCELLENCE\n\nTo accomplish our goals we aim high, and work both hard and smart.\n\nCREATIVITY\n\nThe beauty of culture is that it is always evolving, and so should we. We value out-of- the-box thinking, challenging “the way things are,” and imaginative leaps. Like in art, it is better for us to fail trying something new than to not be experimenting in the first place.\n\nINDHEADOFFICE\nShow less\nSee company reviews"
    },
    {
        "title": "Secretary/Receptionist",
        "Company_name": "Maspeth Supply Co. LLC",
        "location": "Maspeth, NY",
        "salaryEst": "$40K – $60K/yr (Employer est.)",
        "description": "Overview\nWe are seeking a highly organized and professional Receptionist/Secretary to join our team. This role is crucial in ensuring smooth office operations and providing excellent communication amongst the staff. The ideal candidate will possess strong clerical skills, be proficient in operating computers, answering phones, and have experience with filing. If you are detail-oriented and enjoy working in a fast-paced environment, we encourage you to apply.\n\nResponsibilities\n\nGreet and assist visitors in a friendly and professional manner.\nManage incoming calls and direct them to the appropriate personnel.\nOrdering and maintaining office supplies.\nMaintain organized filing systems for both physical and digital documents.\nProvide clerical support including typing, document preparation, and correspondence management.\n\nRequirements\n\nProven experience as a receptionist or in a similar clerical role is preferred.\nProficiency in data entry with excellent typing skills.\nFamiliarity with Microsoft Office applications (Docs, Excel, Mail).\nStrong organizational skills with the ability to multitask effectively.\nExcellent communication skills, both verbal and written.\nAbility to work independently as well as under direction of management.\n\nJob Type: Full-time\n\nPay: $40,000.00 - $60,000.00 per year\n\nBenefits:\n\nHealth insurance\nPaid time off\n\nSchedule:\n\n8 hour shift\n\nAbility to Commute:\n\nMaspeth, NY 11378 (Required)\n\nAbility to Relocate:\n\nMaspeth, NY 11378: Relocate before starting work (Required)\n\nWork Location: In person\n\nShow less"
    },
    {
        "title": "Mailroom Supervisor",
        "Company_name": "Complete Management Solutions",
        "location": "New York, NY",
        "salaryEst": "$26.00/hr (Employer est.)",
        "description": "Job Description\n\nOverview\n\nComplete Management Solutions (CMS) is a provider of integrated workplace solutions. These services include, but are not limited to document services, mail services & reception services. At CMS we aim to deliver exceptional client experiences keeping our clients workplace working!\n\nWe are currently looking for a Mailroom Supervisor to be responsible for managing a team within a mailroom setting. Our ideal candidate should be customer focused, hard-working, able to multi task and reliable.\n\nResponsibilities and Duties\n\nOperate mail center machinery including but not limited to postage metering and document insertion equipment.\nBe able to perform all basic maintenance as needed\nPrepare Schedules and prioritize mail center services\nSubmit daily and monthly reports as required by upper management as well as maintain records for audit purposes\nOrder supplies as needed for the operation\nAdhere to site process and procedures daily\nParticipate in Cross Training\n\nQualifications\n\nHigh School diploma or equivalent\nExcellent Communication Skills\nProficient in Word and Excel\nProfessional appearance and demeanor\nAbility to apply knowledge to task at hand\nMust be able to prioritize, plan and organize work\nAble to lift up to 80 pounds\nWillingness to learn and grow in a mailroom setting\nStrong Work Ethic and Attendance\nLeadership skills strongly preferred\nManager Experience Required\n\nJob Type: Full-time\n\nSalary: $26.00 Per Hour\n\nJob Type: Full-time\n\nPay: $26.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nShift:\n\n8 hour shift\n\nApplication Question(s):\n\nWhat makes you a good candidate for this position?\n\nEducation:\n\nHigh school or equivalent (Preferred)\n\nExperience:\n\nmanagement: 2 years (Required)\nMailroom: 2 years (Required)\nData entry: 2 years (Required)\n\nWork Location: In person\n\nShow more\nSee company reviews"
    },
    {
        "title": "Mailroom Supervisor",
        "Company_name": "Complete Management Solutions",
        "location": "New York, NY",
        "salaryEst": "$26.00/hr (Employer est.)",
        "description": "Job Description\n\nOverview\n\nComplete Management Solutions (CMS) is a provider of integrated workplace solutions. These services include, but are not limited to document services, mail services & reception services. At CMS we aim to deliver exceptional client experiences keeping our clients workplace working!\n\nWe are currently looking for a Mailroom Supervisor to be responsible for managing a team within a mailroom setting. Our ideal candidate should be customer focused, hard-working, able to multi task and reliable.\n\nResponsibilities and Duties\n\nOperate mail center machinery including but not limited to postage metering and document insertion equipment.\nBe able to perform all basic maintenance as needed\nPrepare Schedules and prioritize mail center services\nSubmit daily and monthly reports as required by upper management as well as maintain records for audit purposes\nOrder supplies as needed for the operation\nAdhere to site process and procedures daily\nParticipate in Cross Training\n\nQualifications\n\nHigh School diploma or equivalent\nExcellent Communication Skills\nProficient in Word and Excel\nProfessional appearance and demeanor\nAbility to apply knowledge to task at hand\nMust be able to prioritize, plan and organize work\nAble to lift up to 80 pounds\nWillingness to learn and grow in a mailroom setting\nStrong Work Ethic and Attendance\nLeadership skills strongly preferred\nManager Experience Required\n\nJob Type: Full-time\n\nSalary: $26.00 Per Hour\n\nJob Type: Full-time\n\nPay: $26.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nShift:\n\n8 hour shift\n\nApplication Question(s):\n\nWhat makes you a good candidate for this position?\n\nEducation:\n\nHigh school or equivalent (Preferred)\n\nExperience:\n\nmanagement: 2 years (Required)\nMailroom: 2 years (Required)\nData entry: 2 years (Required)\n\nWork Location: In person\n\nShow less\nSee company reviews"
    },
    {
        "title": "Doorman - Upper East Side",
        "Company_name": "Douglas Elliman Property Mgmt",
        "location": "New York, NY",
        "salaryEst": "$21.00 – $29.00/hr (Employer est.)",
        "description": "For over 100 years we have been dedicated to providing the best residential property management to co-ops, condos and rental properties throughout New York City and beyond.\n\nRanked #1 among New York City's residential management companies, our mission is to provide our clients with superior and responsive management and accurate financial reporting that they can count on to improve their quality of life and valuation of their homes. We also support the City's efforts to reduce carbon emissions through increased energy efficiency in all the properties we manage.\n\nWe are currently seeking Doormen or Concierges to work coverage shifts for a client building located in the Upper East Side of Manhattan on East 82nd St.\n\nDoorman/Concierge Duties:\n\nMeeting, greeting and directing residents and guests.\nVerifying and recording visitor information.\nAnswering calls professionally and assists callers with directions or instructions for the building.\nReceive and process incoming and outgoing laundry, shipments and/or mail/packages.\nMonitor lobby traffic and alert residents to arriving guests and deliveries.\nMaintain logbooks for visitors and contractors\nFollows established procedures set by management\nAssists handyman as instructed\n\nMinimum qualifications:\n\nAbility to communicate effectively\nDetail-oriented, able to multi-task, friendly\nApplicant must have strong inter-personal skills as this position requires interactions with residents and personnel\nPrevious experience working in residential buildings\nFluent in the English Language\nPrior experience in luxury buildings and with BuildingLink preferred\n\nSalary Range: $21-$29 an hour, or as per Union Guidelines\n\nApplicants without a Resume will NOT be Considered\n\n\n\nCompensation: $21-$29\nShow less\nSee company reviews"
    },
    {
        "title": "Receptionist",
        "Company_name": "American Express Global Business Travel",
        "location": "New York, NY",
        "salaryEst": "None",
        "description": "Amex GBT is a place where colleagues find inspiration in travel as a force for good and – through their work – can make an impact on our industry. We’re here to help our colleagues achieve success and offer an inclusive and collaborative culture where your voice is valued.\n\nReady to explore a career path? Start your journey.\n\nTo deliver the highest quality of customer service to staff, visitors and contractors whilst ensuring a friendly front of house welcome. Providing effective and efficient support in the management of room bookings and further assist facilities co-ordination to guarantee a smooth running of the office and reception.\n\nWhat You'll Do:\nMeet all visitors and contractors at reception as first point of call, ensuring first class customer service is always provided.\n\nEnsure all visitors and contractors are registered with building security/reception and logged.\n\nContinually monitor your GBT mailbox and action/file, accordingly, prioritising any urgent tasks as required.\n\nBook meeting room requests for key stakeholders and manage cancellations as these arise.\n\nUpdate the visitors, staff, and contractors log, storing data in the reception folder in line with compliance and ready for audit purposes.\n\nDaily collections of mail/packages from the loading bay. Sorting, logging, and notifying the relevant individuals/departments with special arrangements to be made for larger deliveries.\n\nAction and track outgoing packages and letters for USPS and other carriers.\n\nManage incoming calls in a friendly and polite manner as the face of the Company.\n\nAssist Facilities team in allocation and management of staff and contractor/ visitor passes, replacing and cancelling where necessary.\n\nManage the locker allocation.\n\nLog vendor/building/maintenance service faults if required to support building/facilities management.\n\nSupport in health and safety checks and logging within the office if required to support building/facilities management.\n\nLocation New York, New York, United States\n\nThe US national hourly wage range for this position is from $15.00 to $30.00 per hour. The national range provided includes the hourly rate that GBT expects to pay for the role. Actual hourly wage rate will be based on factors including the scope and complexity of the role and the successful candidate’s relevant experience, skills, knowledge, and work location.\n\nThis role is eligible for an annual Performance Based Incentive, which rewards participants based on company performance. For information about our comprehensive US benefits programs and eligibility, please review our Benefits-at-a-Glance document.\n\nBenefits at a glance\n\nThe #TeamGBT Experience\nWork and life: Find your happy medium at Amex GBT.\n\nFlexible benefits are tailored to each country and start the day you do. These include health and welfare insurance plans, retirement programs, parental leave, adoption assistance, and more.\n\nTravel perks: get a choice of deals each week from major travel providers on everything from flights to hotels to cruises and car rentals.\n\nDevelop the skills you want when the time is right for you, with global tuition assistance, access to over 20,000 courses on our learning platform, leadership courses, and new job openings available to internal candidates first.\n\nWe strive to champion Diversity, Equity, and Inclusion in every aspect of our business at GBT. You can connect with colleagues through our global Inclusion Groups, centered around common identities or initiatives, to discuss challenges, obstacles, achievements, and drive company awareness and action.\n\nWellbeing resources to support mental and emotional health for you and your immediate family.\n\nAnd much more!\n\nA ll applicants will receive equal consideration for employment without regard to age, sex, gender (and characteristics related to sex and gender), pregnancy (and related medical conditions), race, color, citizenship, religion, disability, or any other class or characteristic protected by law.\n\nClick Here for Additional Disclosures in Accordance with the LA County Fair Chance Ordinance.\n\nFurthermore, we are committed to providing reasonable accommodation to qualified individuals with disabilities. Please let your recruiter know if you need an accommodation at any point during the hiring process. For details regarding how we protect your data, please consult GBT Recruitment Privacy Statement .\n\nWhat if I don’t meet every requirement? If you’re passionate about our mission and believe you’d be a phenomenal addition to our team, don’t worry about “checking every box;\" please apply anyway. You may be exactly the person we’re looking for!\nShow less\nSee company reviews"
    },
    {
        "title": "Office Support Assistant",
        "Company_name": "Nixon Peabody LLP",
        "location": "New York, NY",
        "salaryEst": "$41K – $54K/yr (Glassdoor est.)",
        "description": "Job Description:\n\nThe Office Support Assistant is responsible for providing local onsite support to perform a variety of office related duties, with primary responsibility for general housekeeping/day porter services, reception area coverage and hospitality services. Will provide overflow administrative support to Office Services, Accounting, Records and others on a case-by-case basis. Maintains professional contact with clients, attorneys and staff and observes confidentiality of client and firm matters. Effectively, efficiently and thoroughly manages work and information requests.\n\nA career at Nixon Peabody is the opportunity to do work that matters. It’s the chance to use your knowledge to shape what’s ahead. To share, to innovate, to learn at a firm that taps the power of collective thinking.\n\nWe’ve created a dynamic, energizing environment that promotes success for our clients and each other. We offer fast growth, connectedness and training in business as well as law. And our rigorous standards assure you are part of a diverse team of top talent at every turn.\n\nIf you’re someone who’s looking toward the future, we’d love to hear from you.\n\nLocation: New York City, NY\n\nProvide Reception, Hospitality and general housekeeping/day porter services; and overflow administrative support to Office Services, Accounting, Records and others, including practice and global resource assistants, on a case-by-case basis.\nOnsite logistics for visitors to the office.\nMeet and greet all guests and provide onsite support as needed.\nRetrieve information from conference room reservation application and order food/beverages as necessary to accommodate meeting attendees.\nSet up rooms with food, beverages and supplies; replenish as needed.\nMaintain orderly and presentable lobby, conference rooms and office space.\nMonitor lobby and conference room A/V and IT equipment and notify IT of any potential issues.\nDistribute security badges and parking validations and maintain inventory logs as needed.\nFollow firm policies with regard to visitor access to offices and conference rooms.\nMaintain appropriate inventory of kitchen and catering supplies and cleanliness of coffee stations and cafe.\nMaintain hospitality equipment (beverage dispensers, refrigerator, dishwasher, etc).\nProvide backup support to Office Services including copy, scan, print, mail, supplies, etc.\nProvide onsite support to practice and global resource assistants as requested.\nProcess office related expense reimbursements/reconcile firm purchasing cards, vendor invoices and other accounting responsibilities.\nCoordinate with the marketing team on event logistics.\nPerforms other duties as assigned.\n\nTo perform this job successfully, you must be able to perform each essential job responsibility listed above, satisfactorily, with or without reasonable accommodation. Nixon Peabody retains the right to change or assign other duties to this position. The requirements listed below are representative of the skills and abilities required.\n\nJob Requirements:\n\n2-8 years of related experience. Law firm experience preferred.\nAssociate’s Degree preferred. Work experience in lieu of a degree will be considered.\nExcellent interpersonal, communication, and customer service skills.\nPositive and professional demeanor; able to interact effectively with personnel at all levels, including attorneys, staff, and clients.\nAbility to maintain confidentiality.\nDemonstrated organizational skills with attention to detail and ability to organize workload, prioritize tasks and complete them under time constraints.\nAbility to work independently and as part of a team.\nProficient in Microsoft Office Suite and other office technology.\n\nNixon Peabody LLP is an Equal Opportunity / Affirmative Action Employer: Disability / Female / Gender Identity / Minority / Sexual Orientation / Veteran.\n\nTo comply with Federal law, Nixon Peabody participates in E-Verify. All newly-hired employees are verified through this electronic system established by the Department of Homeland Security (DHS) and the Social Security Administration (SSA) to confirm their identity and employment eligibility. Please refer to the Notice of E-Verify Participation and the Right to Work posters on the Nixon Peabody Careers page for more information.\n\nIn accordance with applicable Federal and State laws, the anticipated annual salary range for this position, depending on location, is as follows:\n\nNew York, NY: $50,677 to $69,753\n\nIn addition to a standard benefits package, this role may be eligible for additional contingent compensation based on an array of factors, including but not limited to: work performance, geographic location, work experience, education, and qualifications. Because such contingent compensation is not yet calculable or may be zero ($0) in some circumstances, the above-listed salary range(s) are Nixon Peabody’s good faith estimate of the annual salary(ies) it reasonably expects to pay for the position at the time of this posting.\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nRetirement plan\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nWork Location: In person\n\nShow more\nSee company reviews"
    },
    {
        "title": "Office Support Assistant",
        "Company_name": "Nixon Peabody LLP",
        "location": "New York, NY",
        "salaryEst": "$41K – $54K/yr (Glassdoor est.)",
        "description": "Job Description:\n\nThe Office Support Assistant is responsible for providing local onsite support to perform a variety of office related duties, with primary responsibility for general housekeeping/day porter services, reception area coverage and hospitality services. Will provide overflow administrative support to Office Services, Accounting, Records and others on a case-by-case basis. Maintains professional contact with clients, attorneys and staff and observes confidentiality of client and firm matters. Effectively, efficiently and thoroughly manages work and information requests.\n\nA career at Nixon Peabody is the opportunity to do work that matters. It’s the chance to use your knowledge to shape what’s ahead. To share, to innovate, to learn at a firm that taps the power of collective thinking.\n\nWe’ve created a dynamic, energizing environment that promotes success for our clients and each other. We offer fast growth, connectedness and training in business as well as law. And our rigorous standards assure you are part of a diverse team of top talent at every turn.\n\nIf you’re someone who’s looking toward the future, we’d love to hear from you.\n\nLocation: New York City, NY\n\nProvide Reception, Hospitality and general housekeeping/day porter services; and overflow administrative support to Office Services, Accounting, Records and others, including practice and global resource assistants, on a case-by-case basis.\nOnsite logistics for visitors to the office.\nMeet and greet all guests and provide onsite support as needed.\nRetrieve information from conference room reservation application and order food/beverages as necessary to accommodate meeting attendees.\nSet up rooms with food, beverages and supplies; replenish as needed.\nMaintain orderly and presentable lobby, conference rooms and office space.\nMonitor lobby and conference room A/V and IT equipment and notify IT of any potential issues.\nDistribute security badges and parking validations and maintain inventory logs as needed.\nFollow firm policies with regard to visitor access to offices and conference rooms.\nMaintain appropriate inventory of kitchen and catering supplies and cleanliness of coffee stations and cafe.\nMaintain hospitality equipment (beverage dispensers, refrigerator, dishwasher, etc).\nProvide backup support to Office Services including copy, scan, print, mail, supplies, etc.\nProvide onsite support to practice and global resource assistants as requested.\nProcess office related expense reimbursements/reconcile firm purchasing cards, vendor invoices and other accounting responsibilities.\nCoordinate with the marketing team on event logistics.\nPerforms other duties as assigned.\n\nTo perform this job successfully, you must be able to perform each essential job responsibility listed above, satisfactorily, with or without reasonable accommodation. Nixon Peabody retains the right to change or assign other duties to this position. The requirements listed below are representative of the skills and abilities required.\n\nJob Requirements:\n\n2-8 years of related experience. Law firm experience preferred.\nAssociate’s Degree preferred. Work experience in lieu of a degree will be considered.\nExcellent interpersonal, communication, and customer service skills.\nPositive and professional demeanor; able to interact effectively with personnel at all levels, including attorneys, staff, and clients.\nAbility to maintain confidentiality.\nDemonstrated organizational skills with attention to detail and ability to organize workload, prioritize tasks and complete them under time constraints.\nAbility to work independently and as part of a team.\nProficient in Microsoft Office Suite and other office technology.\n\nNixon Peabody LLP is an Equal Opportunity / Affirmative Action Employer: Disability / Female / Gender Identity / Minority / Sexual Orientation / Veteran.\n\nTo comply with Federal law, Nixon Peabody participates in E-Verify. All newly-hired employees are verified through this electronic system established by the Department of Homeland Security (DHS) and the Social Security Administration (SSA) to confirm their identity and employment eligibility. Please refer to the Notice of E-Verify Participation and the Right to Work posters on the Nixon Peabody Careers page for more information.\n\nIn accordance with applicable Federal and State laws, the anticipated annual salary range for this position, depending on location, is as follows:\n\nNew York, NY: $50,677 to $69,753\n\nIn addition to a standard benefits package, this role may be eligible for additional contingent compensation based on an array of factors, including but not limited to: work performance, geographic location, work experience, education, and qualifications. Because such contingent compensation is not yet calculable or may be zero ($0) in some circumstances, the above-listed salary range(s) are Nixon Peabody’s good faith estimate of the annual salary(ies) it reasonably expects to pay for the position at the time of this posting.\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nRetirement plan\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nWork Location: In person\n\nShow less\nSee company reviews"
    },
    {
        "title": "Temp Community Engagement & Data Entry Coordinator",
        "Company_name": "The Educational Alliance Inc.",
        "location": "New York, NY",
        "salaryEst": "$20.00/hr (Employer est.)",
        "description": "Job Title: Temporary Community Engagement and Data Entry Coordinator\n\nDivision - Department: Sirovich Center for Balanced Living\n\nJob Classification (FLSA): Non-exempt, up to 12 hours weekly. Looking for individuals with availability on Thursdays and Fridays from 8:30am -1:30pm.\n\nSupervisor: Associate Director of Sirovich\n\n\nJOB PURPOSE\n\nSupport program staff with welcoming members to Sirovich Center for Balanced Living (SCBL) by being present in lobby, assisting incoming members with completing SCBL member applications, orientating all members to the center, answering program related questions, signing folks up for classes, trips, food pantry, answering phone calls, overseeing the Sirovich email inbox and replying accordingly, and assisting with the selling of SCBL ceramics, 12 ST swag, and jewelry. Additionally, the community engagement and data entry coordinator ensures all data is entered accurately and timely into Peerplace database (soon to be Vive), to be in compliance with Department for the Aging contractual obligations. Data includes: Class Attendance Sheets, Meal Attendance (breakfast and lunch), Client Satisfaction Survey, Nutrition Risk Survey, Information and Referral, etc.\n\n\nSCOPE OF INFLUENCE\n\nDirect client group: older adult population\nTo ensure excellent customer service to members and accurate data entry\nWork with staff, interns, and volunteers to develop a friendly and welcoming environment for older adults and visitors at the senior centre.\n\n\nKEY RESPONSIBILITIES AND ACCOUNTABILITIES\n\nBe present in lobby, greeting and engaging all members and visitors.\nAssist visitors and members with any and all questions.\nCheck membership card and verify all documents are current in Peerplace (Vive) database.\nCheck-in members according to the sign-in sheet and assist with legible signatures\nSell and collect meal tickets for breakfast and lunch.\nAnswering main phone line and directing calls as needed\nOverseeing Sirovich email inbox and responding to members\nRegistering members for classes trips and food pantry\nDistribute calendar of events and flyers to members as per their interest\nData entry into PeerPlace (Vive) database. Data includes: Class Attendance Sheets, Meal Attendance, Client Satisfaction Survey, Nutrition Risk Survey, Information and Referral and Etc\nSelling of SCBL ceramics, 12 ST swag, and jewelry\nAdditional Miscellaneous administrative tasks\nPerform other related duties as assigned.\n\n\nJOB REQUIREMENTS\n\nRequired Knowledge\n\nStrong computer and Microsoft office and excel knowledge and skill\nNeeds to be very comfortable using databases and troubleshooting issues\nInvested in fostering a harmonious community and embracing our diverse older adult population.\nRemain on feet for extended periods of time\nDetail oriented, effective written and verbal communication skills.\nEager team collaborator interested in all aspects of engaging older adults, including attending program planning meetings.\nAvid multitasker who is expert in juggling multiple member requests with professionalism and patience.\n\n\nRole Key Competencies\n\nTechnical and Professional Knowledge\nQuality Focus\nAvid multitasker\nStress Tolerance\nSafety Awareness\nFlexibility\nTeam-player\nExcellent communication and customer skills\n\n\nEEO Info\n\nAll qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, national origin, age, disability, or protected veteran status. Educational Alliance takes affirmative action in support of its policy to employ and advance in employment individuals who are minorities, women, protected veterans, and individuals with disabilities.\n\nShow more\nSee company reviews"
    },
    {
        "title": "Part-time Budtender Role",
        "Company_name": "Matawana",
        "location": "Brooklyn, NY",
        "salaryEst": "$19.00 – $20.00/hr (Employer est.)",
        "description": "Budtender Role\n\n\nFull Job Description\n\n\nPosition Summary\n\n\nAre you looking for the perfect opportunity to get your foot in the cannabis industry?\n\n\n\n\nConfidence, dedication, and integrity are key when considering applicants.\nBasic cannabis product knowledge is preferred, but a willingness to learn is essential.\nExcellent conversational skills and previous customer service experience is ideal but not required.\n\n\nSounds like you? Submit your resume for consideration, only those selected for an interview will be contacted.\n\n\nMain Duties/Responsibilities\n\nMaintain the organization and cleanliness of the store.\nProvide excellent customer service before, during and after the sales experience.\nDevelop and maintain knowledge of all vendors and products in store inventory.\nAttending ongoing product knowledge training sessions.\nFollow all operational rules, regulations, policies, and procedures.\n\n\nAbout You\n\nMinimum 21+ years of age.\nLegally authorized to work in the New York Cannabis Industry.\nPrior retail or customer service experience is an asset.\nA willingness to grow and develop Sales and Customer Service skills.\nAble to pass all background checks as required by state cannabis agency.\nAble to accommodate scheduling that may include varied shifts, weekends, and holidays.\n\n\nCompensation\n\nPart-time or Full-time\n$19.00 to $20.00 per hour\nShow less"
    },
    {
        "title": "Store Associate",
        "Company_name": "CVS Health",
        "location": "New York, NY",
        "salaryEst": "$16.50 – $22.00/hr (Employer est.)",
        "description": "At CVS Health, we’re building a world of health around every consumer and surrounding ourselves with dedicated colleagues who are passionate about transforming health care.\n\nAs the nation’s leading health solutions company, we reach millions of Americans through our local presence, digital channels and more than 300,000 purpose-driven colleagues – caring for people where, when and how they choose in a way that is uniquely more connected, more convenient and more compassionate. And we do it all with heart, each and every day.\n\nPosition Summary\n\n\nRetail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we’re shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person’s unique healthcare needs. Join our team of thousands as we positively impact millions…one customer at a time.\n\nThe Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.\n\nEssential Functions:\n\n\n\nProviding differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues\n\nFocusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed\n\nAccurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures\n\nMaintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager\n\nSupporting opening and closing store activities, when needed\n\nProviding customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools\n\nAssisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development\n\nEmbracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health\n\nRequired Qualifications\n\nAt least 16 years of age\n\nPhysical Requirements:\n\nRemaining upright on the feet, particularly for sustained periods of time\n\nLifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting\n\nVisual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details\n\nPreferred Qualifications\n\nPrevious experience in a retail or customer service setting\n\nEducation\n\nHigh School diploma or equivalent preferred but not required.\n\nAnticipated Weekly Hours\n\n29\n\nTime Type\n\nPart time\n\nPay Range\n\nThe typical pay range for this role is:\n\n$16.50 - $22.00\n\nThis pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.\n\n\nOur people fuel our future. Our teams reflect the customers, patients, members and communities we serve and we are committed to fostering a workplace where every colleague feels valued and that they belong.\n\nGreat benefits for great people\n\nWe take pride in our comprehensive and competitive mix of pay and benefits – investing in the physical, emotional and financial wellness of our colleagues and their families to help them be the healthiest they can be. In addition to our competitive wages, our great benefits include:\n\nAffordable medical plan options, a 401(k) plan (including matching company contributions), and an employee stock purchase plan.\n\nNo-cost programs for all colleagues including wellness screenings, tobacco cessation and weight management programs, confidential counseling and financial coaching.\n\nBenefit solutions that address the different needs and preferences of our colleagues including paid time off, flexible work schedules, family leave, dependent care resources, colleague assistance programs, tuition assistance, retiree medical access and many other benefits depending on eligibility.\n\nFor more information, visit https://jobs.cvshealth.com/us/en/benefits\n\nWe anticipate the application window for this opening will close on: 06/11/2025\n\nQualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state and local laws.\n\nShow less\nSee company reviews"
    },
    {
        "title": "Part-Time Information Technology Support Apprentice - 17 Hours Per Week",
        "Company_name": "William F Ryan Community Health Cen",
        "location": "New York, NY",
        "salaryEst": "$25.00/hr (Employer est.)",
        "description": "Position Overview:\n\nUnder the direction of the Senior Director of Information Technology, the Information Technology (IT) Support Apprentice will have the opportunity to work closely with the technology team and gain hands-on experience in various aspects of technology operations and support. The IT Support Apprentice will contribute to the planning, implementation, and maintenance of technology systems while assisting in troubleshooting and resolving technical issues. This part-time, one-year, apprenticeship is designed to provide practical exposure to the field of technology and support your professional growth. All work shall be conducted in support of the mission and goals of Ryan Health.\n\nEssential Functions:\n\nAssist in the installation, configuration, and maintenance of hardware and software systems.\nCollaborate with team members to provide technical support and resolve end-user issues.\nPerform routine system monitoring and maintenance tasks to ensure optimal performance and availability.\nContribute to the development and implementation of technology projects and initiatives.\nCollaborate with cross-functional teams to support technology-related projects and initiatives.\nAssist in the implementation, testing and quality assurance of new technology solutions.\nAssist and maintain technical documentation, including system configurations, procedures, and troubleshooting guides.\nStay updated with emerging technologies and industry trends and share knowledge with the team.\nParticipate in meetings, workshops, and training sessions to enhance technical knowledge and skills.\nAssist in report production, maintenance, and support of the IT Systems.\nAttend all meeting and/or training sessions as required.\nOther special projects/assignments, as needed.\n\nMinimum Experience and Skills Required:\n\nClassroom experience with Computer hardware and software along with minimum of 6 months information technology support experience.\nExperience with providing desktop and application support is preferred.\nMust be able to work in a team-focused environment to accomplish goals, task, and projects.\nMust be proactive, self-driven, and able to resolve problems with minimal direction and oversight.\nHealthcare experience is a plus.\nExcellent communication and interpersonal skills\n\nEducation, Licenses and/or Certifications Required:\n\nB.A. or B.S., preferably in Information Technology, Management, or Health Care, or High School Diploma, with IT certifications (CompTIA, Network+) and 1 Year of equivalent work experience\n\nPreferred Qualifications:\n\nBasic Information Technology educational background or hands-on experience.\nCompTIA and Network+ is preferred.\nExperience desktop and corporate application support is preferred.\n\nCompetencies Required\n\nCustomer Service:\n\nProfessional, courteous, and respectful conduct when dealing with fellow employees: IT staff, management, and clinicians.\nCommitment to work towards the goals, strategy and mission of the organization as set forth by management.\n\nCooperation/Teamwork\n\nWorks well with others\nContributes input to improve outcomes.\nAsks others for opinions and feedback; provides feedback in a tactful and respectful way.\n\nMinimal Training Time:\n\n90-day introductory period.\n\nWorking Conditions:\n\nPhysical Demands\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nWhile performing the duties of this job, the employee is frequently required to sit, talk and hear.\n\nThe employee is occasionally required to move about the office; use hands and fingers to feel, handle, or operate office equipment.\n\nSpecific vision abilities required by this job include close vision and the ability to adjust focus.\n\nWork Environment\n\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nDisclaimer\n\nThe duties listed above are intended only as illustrations of the various types of work that may be performed. The omission of specific statements of duties does not exclude them from the position if the work is similar, related or a logical assignment to the position. This position may be required to perform other duties. If such work becomes a permanent and regular part of the job, a new description will be prepared.\n\nEqual Opportunity Employer\n\nRyan Health is an Equal Opportunity Employer and does not discriminate on the basis of age, color, disability, ethnicity, marital or family status, national origin, race, religion, sex, sexual orientation, gender identity, military veteran status, or any other characteristic protected by law.\n\nShow less\nSee company reviews"
    },
    {
        "title": "Receptionist",
        "Company_name": "DAVIDA SALON INC",
        "location": "New York, NY",
        "salaryEst": "$20.00 – $25.00/hr (Employer est.)",
        "description": "Benefits:\n\nTraining & development\n\nBenefits/Perks\n\nCompetitive Hourly Pay\nCareer Growth Opportunities\nFun and Energetic Environment\nDiscount on Products and Services\n\nJob Summary\nWe are looking for a friendly, welcoming receptionist/concierge to join our team!\n\nAs the receptionist for our busy salon, you will be the first point of contact for our guests. You will greet customers as they arrive, book appointments, and answer phone calls, as well as attend to the needs of customers throughout their salon visits. The ideal candidate has a cheerful disposition, excellent communication, and computer skills, and is capable of multitasking.\n\nResponsibilities\n\nGreet guests as they arrive at the salon\nAnswer phone calls and schedule appointments\nAssist with maintaining a clean and inviting environment\nProvide general customer service and attend to the needs of customers throughout their services\n\nQualifications\n\nTwo or more years of customer service experience is preferred\nPrevious experience as a receptionist is preferred\nExcellent communication skills with a focus on customer service\nStrong work ethic and positive attitude\nFamiliar with computers and scheduling software\nExcellent multi-tasking skills\nShow less\nSee company reviews"
    },
    {
        "title": "Office Assistant",
        "Company_name": "ARROJO NYC",
        "location": "New York, NY",
        "salaryEst": "$40K – $50K/yr (Employer est.)",
        "description": "We are seeking a detail-oriented and organized Office Assistant to join our team! This role is perfect for someone who thrives in a fast-paced environment and is eager to grow with an independent beauty brand. You’ll play a key role in our daily operations, ensuring smooth processing of orders, shipments, invoices, and other administrative tasks.\n\nResponsibilities:\n\nProcess and fulfill customer orders with accuracy and efficiency\nCoordinate product shipping and ensure timely deliveries\nHandle invoicing and maintain organized records\nAssist with inventory management and restocking as needed\nProvide administrative support and handle miscellaneous tasks as required\n\nQualifications:\n\nHighly organized with strong attention to detail\nAbility to multitask and prioritize in a dynamic work environment\nBasic experience with order processing and invoicing (a plus, but not required)\nStrong communication and problem-solving skills\nEager to learn and grow within the beauty industry\n\nThis is a great opportunity to be part of a passionate, growing brand and develop valuable skills in operations and logistics. Apply today!\n\nJob Type: Full-time\n\nPay: $40,000.00 - $50,000.00 per year\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nProfessional development assistance\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nShift:\n\n8 hour shift\n\nAbility to Commute:\n\nNew York, NY 10014 (Required)\n\nAbility to Relocate:\n\nNew York, NY 10014: Relocate before starting work (Required)\n\nWork Location: In person\n\nShow less\nSee company reviews"
    },
    {
        "title": "Office Assistant",
        "Company_name": "Project Find",
        "location": "New York, NY",
        "salaryEst": "$18.00 – $22.00/hr (Employer est.)",
        "description": "Project FIND’s mission is to provide low- and moderate-income and homeless seniors with the services and support they need to enrich their lives and live independently. Today Project FIND operates three supportive housing residences that are home to about 600 people and four senior centers with over 3,000 members. Our members and residents range from the healthy and active to the frail and homebound to the homeless. For all these men and women, Project FIND is a critical resource, providing housing, meals, and programs that help individuals navigate the challenges of aging by encouraging community engagement and healthy living. Please visit our website at: www.projectfind.org.\n\n\n\n\nJob Summary:\n\nUnder the guidance of the Director of Administrative Services, the Office Assistant will work to support the administrative needs of Project FIND. In addition to the regular responsibilities noted below, the Office Assistant will assist in special projects as they may arise.\n\n\n\n\nGeneral Administrative Support:\n\nAnswer and direct phone calls to appropriate parties.\nGreet clients and visitors, ensuring they are directed to the appropriate person or department.\nAssist the Director in maintaining office inventory, including supplies such as paper, pens, cleaning materials, and coffee.\nManage sorting and distribution of incoming and outgoing mail.\nRetrieve packages from the lobby as requested.\nDigitally archive historic hard-copy records of quarterly meetings for Project FIND’s Board and committees.\nAssist with logistical operations and minutes for board meetings.\nProvide basic IT troubleshooting, including resolving printer issues, setting up office equipment, and assisting staff with software or connectivity problems.\nCoordinate with IT support services for more complex technical issues.\nAssist with scheduling and management of calendars in Outlook for select senior leaders.\nOther duties as assigned\n\nFiscal Support:\n\nUpload invoices into the AvidXchange system to ensure timely bill payments.\nProcess non-rental checks by uploading them into the JotForm system, entering accurate details, and providing hard copies to the appropriate department.\nDistribute rental checks to the designated recipient.\nScan and forward documents with clear and informative subject lines.\nAssist with accounting tasks related to 1099 and W-2 forms, ensuring all have been properly sent out.\n\nProperty Management Support:\n\nUpload department-related documents (e.g., subsidy rent changes, housing inspections) into the JotForm system with accurate details.\nScan and forward general rental applications to the appropriate recipient with an informative subject line.\nUpload Hamilton lottery applications into the JotForm system, enter accurate details, and provide hard copies to the appropriate person.\nPrint, post, and mail letters as requested.\n\nDevelopment & External Relations Support:\n\nUpload incoming donations and accompanying documents into the Jot Form system and fill in the correct information on the form and give the hard copies to the fiscal department.\nAssist the department with the proper accounting of donations and distribution of acknowledgement letters to donors.\n\nQualifications:\n\nHigh School Diploma or GED OR a minimum of two years’ relevant experience in social services.\nAbility to interact with staff, clients, and visitors professionally and courteously.\nStrong computer proficiency, including Microsoft Office Suite (Word, Excel, Outlook, PowerPoint).\nExcellent organizational skills with strong attention to detail.\nCommitment to Project FIND’s mission and values.\nExceptional customer service skills with a client-centered approach.\nAbility to prioritize tasks, multi-task efficiently, and manage time effectively\nProblem-solving skills with the ability to research and resolve inquiries using available tools and resources.\n\nProject FIND participates in E-Verify, which confirms employment authorization through an electronic database maintained by the Social Security Administration and Department of Homeland Security. The E-Verify process is completed in conjunction with the Form I-9 Employment Eligibility Verification. E-Verify is not used as a tool to pre-screen candidates.\n\nShow less\nSee company reviews"
    },
    {
        "title": "Part-Time Sales Associate - Famous Footwear",
        "Company_name": "Famous Footwear",
        "location": "New York, NY",
        "salaryEst": "$17.00 – $18.50/hr (Employer est.)",
        "description": "As a Famous Footwear Sales Associate, you are passionate about providing the best shoe store experience for every customer. You do this by creating a welcoming environment and in-store culture where customers say, “I’ll take it” and are loyal to your store, our brands, and our company. You are a team player, celebrating individual and team successes. You are committed to staying informed about trends and sharing that knowledge with customers, ultimately building engaging customer experiences. Most importantly, you LOVE shoes and regardless of your style, you help every person who enters the store experience a little bit of that Famous Feeling.\n\nWhat You’ll be Doing\n\n\nAce Retail Operations: You’ll ensure daily store tasks (pricing, shipment processing, fulfillment and inventory) are dialed in, keeping the store running like a tightly laced sneaker. Utilizing our company standards as a framework for success, you’ll deliver on our goal of keeping the store clean, organized, and all our famous styles easily shoppable.\nBe a Famous Culture Influencer: Champion our Famous culture with pride by embodying the behaviors that power our Customer Connection. You’ll provide stellar customer engagement, leaving customers wowed with consistently top-notch experiences powered by your attentiveness and determination to deliver them the styles and brands they crave.\nElevate to Your Goal-Crushing Era: You’ll bring your best to each day; take accountability for your effort and its impact on Famous Footwear’s overall performance. You’ll review store performance and drive sales with purpose and urgency to achieve goals. Every shoe sale counts! As a ‘goal-getter’, you deliver clear, concise and timely communications to the entire store team and employ active listening to ensure understanding among teammates.\nAct with Integrity: Your high standards will keep you sticking to company policies and procedures. Always acting with integrity, you’ll be open to and seek feedback to improve your skillset and further your professional development!\nBring the Positive Vibes: Embrace diversity and inclusivity as our team superpower, upholding a work environment where every associate feels included and respected. Maintain a positive and proactive mindset, even in the face of challenges, you’re the type of person to uplift and support others. To help others be their best, you’ll help your teammates be their best selves by assisting with training and development when needed.\nBe a Shoe-off: You are shoe-obsessed (no judgment.) When a customer enters the store, you’re a shoe sleuth on the hunt for the perfect styles to suit their needs. It brightens your day to make shoe recommendations and ensure our customers leave the store with the perfect fit…and that Famous Feeling.\nEssential Functions: Other responsibilities may be performed as needed to ensure the needs of the business are met. Overtime hours may be required to meet business needs.\n\nPerks You’ll Enjoy!\n\nOur Shoe Discounts. No matter your style, we’ve got your perfect fit covered with a 30% Associate Discount across Caleres’s retail stores – Famous Footwear, Naturalizer, Sam Edelman, and Allen Edmonds.\nRelaxed Dress Code & Small Team Environment. You will be a valued member in a supportive and hands-on setting. Our relaxed dress code policy lets you showcase your authentic self while you work.\nDaily Access to Pay. Love an early pay day? Get paid as you earn (without the fees) with Dayforce Wallet.\nEase of Transferring Locations. We have over 850 store locations you can easily transfer within.\nCareer Development and Learning Opportunities. We provide education assistance of up to $7500 per year for full-time associates and provide opportunities for associates who want to grow their careers at our corporate offices.\nEmployee Assistance Programs. Receive 24/7 access to a comprehensive suite of individual support options, including emotional support, work-life solutions, legal guidance, financial resources and more, via online & phone.\nBenefit Offerings: PTO, Health, and Retirement for eligible full-time associates. To learn more details about our Total Rewards program, visit www.yourcaleres.com.\nPreferred Qualifications & Education\n\nHigh School Diploma/GED\nAble to build constructive and effective relationships within store\nDemonstrates an ability to communicate positively with store associates at all levels\nMust exercise independent judgment and discretion partnering with Store Sales Manager as needed\nStrong working knowledge of general retail practices and procedures\nAbility to work effectively within a team\nAbility to work a flexible schedule to meet the needs of the business, including holidays, nights, weekends and extended hours\nPhysical Requirements and/or Environment\n\nAbility to regularly lift up to 40 lbs. from floor level to above shoulder height utilizing appropriate equipment and safety techniques;\nAbility to meet demands of frequent walking, standing, stooping, kneeling, climbing, pushing, pulling, and repetitive lifting;\nAbility to be mobile on the sales floor for extended periods of time.\nShow more\nSee company reviews"
    },
    {
        "title": "Part-Time Sales Associate - Famous Footwear",
        "Company_name": "Famous Footwear",
        "location": "New York, NY",
        "salaryEst": "$17.00 – $18.50/hr (Employer est.)",
        "description": "As a Famous Footwear Sales Associate, you are passionate about providing the best shoe store experience for every customer. You do this by creating a welcoming environment and in-store culture where customers say, “I’ll take it” and are loyal to your store, our brands, and our company. You are a team player, celebrating individual and team successes. You are committed to staying informed about trends and sharing that knowledge with customers, ultimately building engaging customer experiences. Most importantly, you LOVE shoes and regardless of your style, you help every person who enters the store experience a little bit of that Famous Feeling.\n\nWhat You’ll be Doing\n\n\nAce Retail Operations: You’ll ensure daily store tasks (pricing, shipment processing, fulfillment and inventory) are dialed in, keeping the store running like a tightly laced sneaker. Utilizing our company standards as a framework for success, you’ll deliver on our goal of keeping the store clean, organized, and all our famous styles easily shoppable.\nBe a Famous Culture Influencer: Champion our Famous culture with pride by embodying the behaviors that power our Customer Connection. You’ll provide stellar customer engagement, leaving customers wowed with consistently top-notch experiences powered by your attentiveness and determination to deliver them the styles and brands they crave.\nElevate to Your Goal-Crushing Era: You’ll bring your best to each day; take accountability for your effort and its impact on Famous Footwear’s overall performance. You’ll review store performance and drive sales with purpose and urgency to achieve goals. Every shoe sale counts! As a ‘goal-getter’, you deliver clear, concise and timely communications to the entire store team and employ active listening to ensure understanding among teammates.\nAct with Integrity: Your high standards will keep you sticking to company policies and procedures. Always acting with integrity, you’ll be open to and seek feedback to improve your skillset and further your professional development!\nBring the Positive Vibes: Embrace diversity and inclusivity as our team superpower, upholding a work environment where every associate feels included and respected. Maintain a positive and proactive mindset, even in the face of challenges, you’re the type of person to uplift and support others. To help others be their best, you’ll help your teammates be their best selves by assisting with training and development when needed.\nBe a Shoe-off: You are shoe-obsessed (no judgment.) When a customer enters the store, you’re a shoe sleuth on the hunt for the perfect styles to suit their needs. It brightens your day to make shoe recommendations and ensure our customers leave the store with the perfect fit…and that Famous Feeling.\nEssential Functions: Other responsibilities may be performed as needed to ensure the needs of the business are met. Overtime hours may be required to meet business needs.\n\nPerks You’ll Enjoy!\n\nOur Shoe Discounts. No matter your style, we’ve got your perfect fit covered with a 30% Associate Discount across Caleres’s retail stores – Famous Footwear, Naturalizer, Sam Edelman, and Allen Edmonds.\nRelaxed Dress Code & Small Team Environment. You will be a valued member in a supportive and hands-on setting. Our relaxed dress code policy lets you showcase your authentic self while you work.\nDaily Access to Pay. Love an early pay day? Get paid as you earn (without the fees) with Dayforce Wallet.\nEase of Transferring Locations. We have over 850 store locations you can easily transfer within.\nCareer Development and Learning Opportunities. We provide education assistance of up to $7500 per year for full-time associates and provide opportunities for associates who want to grow their careers at our corporate offices.\nEmployee Assistance Programs. Receive 24/7 access to a comprehensive suite of individual support options, including emotional support, work-life solutions, legal guidance, financial resources and more, via online & phone.\nBenefit Offerings: PTO, Health, and Retirement for eligible full-time associates. To learn more details about our Total Rewards program, visit www.yourcaleres.com.\nPreferred Qualifications & Education\n\nHigh School Diploma/GED\nAble to build constructive and effective relationships within store\nDemonstrates an ability to communicate positively with store associates at all levels\nMust exercise independent judgment and discretion partnering with Store Sales Manager as needed\nStrong working knowledge of general retail practices and procedures\nAbility to work effectively within a team\nAbility to work a flexible schedule to meet the needs of the business, including holidays, nights, weekends and extended hours\nPhysical Requirements and/or Environment\n\nAbility to regularly lift up to 40 lbs. from floor level to above shoulder height utilizing appropriate equipment and safety techniques;\nAbility to meet demands of frequent walking, standing, stooping, kneeling, climbing, pushing, pulling, and repetitive lifting;\nAbility to be mobile on the sales floor for extended periods of time.\nShow less\nSee company reviews"
    },
    {
        "title": "Part Time Retail Floor Team Member",
        "Company_name": "Whole Foods Market",
        "location": "New York, NY",
        "salaryEst": "$18.00 – $25.40/hr (Employer est.)",
        "description": "A career at Whole Foods Market is more than just the work you do- it's about your personal growth and creating meaningful change. Our purpose is to nourish people and the planet. That means improving how people eat, funding grants for school gardens, providing access to fresh and healthy food to people living within food deserts, alleviating poverty in developing countries, and so much more. Working with us means you are making a difference within your community and beyond. We aren't just a grocery store: we're world-changers. And with your help, we will continue to set the standards of excellence and revolutionize the grocery industry.\n\nJob Profile Summary Team Members will have the exciting opportunity to be cross-trained and work throughout various departments, constantly learning about new products and areas of the store.\nResponsibilities:\n\nProvide exceptional customer service and address the needs of customers in a timely and effective manner.\n\nWill be cross-trained and work in multiple areas throughout the store, including cashiering/SCO, coffee venue, facing, and stocking.\n\nSupports the auditing of store tags, signs, and scale prices to confirm tag / signage / price accuracy.\n\nRotate products and remove out-of-date products.\n\nBe aware of new products and their placement.\n\nSupport the highest retail standards are being met.\n\nFollow all Daily Shop program, goals, and all Standards Operating Procedures (SOPs).\n\nParticipate in fiscal period and quarter end inventories.\n\nCommunicate all pertinent information to leadership.\n\nStay informed on all company and store level information from leadership.\n\nComplete all required training on time.\n\nMaintain a positive work environment.\n\nUse courteous and proper phone etiquette when answering the phones and pages.\n\nFollow and comply with all applicable health and sanitation procedures and adhere to safe work practices.\n\nSupport overall store cleanliness and maintenance. Follow established food safety, organic guidelines, and procedures.\n\nAttend all meetings as assigned by Leadership, including daily huddles.\n\nKnowledge, Skills, & Abilities:\n\nBasic computer skills.\n\nProactive problem-solver with excellent follow-through, listening skills, and ability to follow instructions and procedures.\n\nClear and effective communication style, both written and verbal.\n\nAbility to build and maintain positive relationships with individuals in positions throughout various levels of the business.\n\nSupports the Daily Shop culture and is an example of Whole Foods Market’s Core Values.\n\nDemonstrates responsibility and accountability in recognizing and accomplishing all tasks where there is a direct job responsibility.\n\nProven experience meeting all customer service expectations and standards when interacting with customers, vendors, and fellow Team Members.\n\nProper use of, which may include but not limited to, knives, personal protective equipment, forklift, pallet jacks, hand trucks, six-wheel carts, baler (must be 18 years of age or older) and all other equipment used during preparation and clean up within department and store.\n\nAble to perform the physical requirements of the job with or without reasonable accommodation.\n\nDesire to be a part of a new, exciting brand.\n\nDesired Work Experiences:\n\nPrior retail, restaurant or hospitality experience is preferred.\n\nPhysical Requirements/ Working Conditions:\n\nMust be able to lift fifty pounds.\n\nIn an 8-hour workday: standing/walking 6-8 hours.\n\nHand use: single grasping, fine manipulation, pushing and pulling.\n\nWork requires the following motions: bending, twisting, squatting, and reaching.\n\nExposure to FDA approved cleaning chemicals.\n\nExposure to temperatures: <32 degrees Fahrenheit (freezing), 32-40 degrees Fahrenheit (refrigerators), >90 degrees Fahrenheit.\n\nAbility to work in a wet and cold environment.\n\nAbility to work a flexible schedule including nights, weekends, and holidays as needed.\n\nThe wage range for this position is $18.00 - $21.70 Hourly, commensurate with experience. Whole Foods Market offers “Whole Benefits\". Whole Benefits may include health insurance, retirement plan benefits, eligibility for a store discount, paid time off and access to other benefit programs. Eligibility for Whole Benefits is determined under the terms of the applicable Whole Benefits plan at a person’s date of hire. New entry level Team Members who successfully complete their first 90-days of employment and who remain actively employed in an eligible role, may be eligible for a base rate increase after their 90-day anniversary. At Whole Foods Market, we provide a fair and equal employment opportunity for all Team Members and candidates regardless of race, color, religion, national origin, gender, pregnancy, sexual orientation, gender identity/expression, age, marital status, disability, or any other legally protected characteristic. Whole Foods Market hires and promotes individuals solely based on qualifications for the position to be filled and business needs. Whole Foods Market works with job sites like Indeed, LinkedIn, and ZipRecruiter to promote opportunities at our company. Please be aware that other career sites may not be accurate or up to date and may even be fraudulent. We encourage and recommend all candidates to apply via our site.\nShow more\nSee company reviews"
    },
    {
        "title": "Front Desk Receptionist",
        "Company_name": "Goodland Pickleball",
        "location": "Brooklyn, NY",
        "salaryEst": "$20.00/hr (Employer est.)",
        "description": "Job Summary\nWe are seeking a friendly and organized Front Desk Receptionist to join our team. The ideal candidate will be the first point of contact for incoming new clients, members, and/or visitors, providing exceptional customer service while managing various administrative tasks.\nPerks: FREE pickleball membership and merch.\n\nResponsibilities\n\nGreet and welcome guests as they arrive, ensuring a positive first impression.\nAnswer phone calls with professionalism and courtesy, demonstrating excellent phone etiquette.\nKeep track of courts usage to efficiently book new court reservations.\nHelp customers/members identifying their court if needed.\nMaintain an organized front desk area, ensuring all materials are stocked and readily available.\nAssist with office and/or event management tasks such as special events, tournaments, birthdays, etc.\nCommunicate effectively with team members to ensure seamless operations within the office.\n\nQualifications\n\nProficient in calendar management and time management skills to prioritize tasks effectively.\nStrong organizational skills with a keen eye for detail to maintain accuracy in all tasks.\nFamiliarity with front desk operations and office management practices is beneficial.\nProficiency in Google Suite applications (Docs, Sheets, Calendar) is highly desirable.\nBilingual in Spanish is a plus, enhancing communication with a broader range of clients.\nExcellent interpersonal skills with the ability to remain calm under pressure while providing outstanding service.\nBeing a pickleball and/or racquet sports enthusiast/player is preferred but not required.\n\nWe invite enthusiastic candidates who are passionate about creating a welcoming environment in Brooklyn's new best \"Pickleball Hub.\"\n\nJob Type: Part-time\n\nPay: $20.00 per hour\n\nSchedule:\n\nEvening shift\nEvery weekend\nMorning shift\n\nWork Location: In person\n\nShow less"
    }
]